{"mov": 1, "CONST": 2, "eax": 3, "cjmp": 4, "call": 5, "rax": 6, "rcx": 7, "push": 8, "lea": 9, "ecx": 10, "edx": 11, "cmp": 12, "test": 13, "dword [ebp + CONST]": 14, "esi": 15, "qword [rsp + CONST]": 16, "rbx": 17, "ebx": 18, "edi": 19, "rdx": 20, "pop": 21, "jmp": 22, "add": 23, "rdi": 24, "xor": 25, "rsi": 26, "qword [rip + CONST]": 27, "sub": 28, "ebp": 29, "r8": 30, "rsp": 31, "r8d": 32, "al": 33, "qword [rbp + CONST]": 34, "[rip + CONST]": 35, "dword [CONST]": 36, "ret": 37, "dword [rsp + CONST]": 38, "rbp": 39, "qword [rax + CONST]": 40, "esp": 41, "r14": 42, "movzx": 43, "[rsp + CONST]": 44, "r9d": 45, "[ebp + CONST]": 46, "and": 47, "dword [esp + CONST]": 48, "dword [rbp + CONST]": 49, "r9": 50, "nop": 51, "r15": 52, "[rbp + CONST]": 53, "r12": 54, "inc": 55, "qword [rbx + CONST]": 56, "or": 57, "ax": 58, "dword [eax + CONST]": 59, "xmm0": 60, "qword [rcx]": 61, "dword [esi + CONST]": 62, "r13": 63, "qword [rdi + CONST]": 64, "r14d": 65, "qword [rcx + CONST]": 66, "r15d": 67, "dword [eax]": 68, "r12d": 69, "movsxd": 70, "qword [rax]": 71, "cl": 72, "dword [rbx + CONST]": 73, "dl": 74, "qword [rbx]": 75, "r13d": 76, "dword [esp]": 77, "dword [ebx + CONST]": 78, "dec": 79, "r10d": 80, "dword [rip + CONST]": 81, "byte [ebp + CONST]": 82, "r11": 83, "shr": 84, "dword [rax]": 85, "bl": 86, "r11d": 87, "dword [rax + CONST]": 88, "int3": 89, "r10": 90, "xmm1": 91, "qword [rdi]": 92, "qword [r11 + CONST]": 93, "dx": 94, "qword [rsi + CONST]": 95, "dword [rcx + CONST]": 96, "shl": 97, "dword [edi + CONST]": 98, "imul": 99, "dword [ecx + CONST]": 100, "dword fs:[eax]": 101, "dword [esi]": 102, "dword [rdi + CONST]": 103, "sar": 104, "movups": 105, "byte [rax]": 106, "cx": 107, "[rax + CONST]": 108, "byte [rsp + CONST]": 109, "[rbx + CONST]": 110, "dword [edx + CONST]": 111, "lock": 112, "movsd": 113, "[rdi + CONST]": 114, "qword [rsi]": 115, "bx": 116, "dword [rsi + CONST]": 117, "movsx": 118, "word [bp + CONST]": 119, "qword [rdx + CONST]": 120, "[rcx + CONST]": 121, "[rdx + CONST]": 122, "qword [rdx]": 123, "movaps": 124, "byte [eax + CONST]": 125, "dword [edi]": 126, "dword [ebx]": 127, "si": 128, "sbb": 129, "word [ebp + CONST]": 130, "byte [rbx + CONST]": 131, "dword [ecx]": 132, "[rsi + CONST]": 133, "[esp + CONST]": 134, "byte [rbp + CONST]": 135, "byte [eax]": 136, "xmmword [rbp + CONST]": 137, "r8b": 138, "neg": 139, "dil": 140, "sete": 141, "word [rsp + CONST]": 142, "qword [r14]": 143, "byte [rcx + CONST]": 144, "byte [rax + CONST]": 145, "di": 146, "qword [r14 + CONST]": 147, "setne": 148, "xmm2": 149, "sil": 150, "xmmword [rsp + CONST]": 151, "movdqu": 152, "xmm6": 153, "movdqa": 154, "[esi + CONST]": 155, "word [rbp + CONST]": 156, "qword [r8 + CONST]": 157, "cmove": 158, "movabs": 159, "dword es:[edi]": 160, "not": 161, "leave": 162, "dword [rdx + CONST]": 163, "byte [ebx + CONST]": 164, "byte [esi + CONST]": 165, "cmovne": 166, "byte [rip + CONST]": 167, "dword ptr [esi]": 168, "dword [rdi]": 169, "dword [rbx]": 170, "movss": 171, "bp": 172, "dword [edx]": 173, "byte [rdi + CONST]": 174, "r9b": 175, "dword [rcx]": 176, "xmm3": 177, "xmmword [rip + CONST]": 178, "r14b": 179, "dword [rax + rax]": 180, "[r14 + CONST]": 181, "qword [r15 + CONST]": 182, "dword [r14 + CONST]": 183, "ror": 184, "qword [r15]": 185, "[r8 + CONST]": 186, "cdq": 187, "r12b": 188, "fld": 189, "byte [esi]": 190, "[ebx + CONST]": 191, "[edi + CONST]": 192, "byte [CONST]": 193, "xorps": 194, "cmovae": 195, "word [rax]": 196, "bt": 197, "word [rax + rax]": 198, "[r9 + CONST]": 199, "fstp": 200, "r15b": 201, "byte [rbx]": 202, "r8w": 203, "bpl": 204, "word [rbx + CONST]": 205, "qword [r8]": 206, "dword [rdx]": 207, "[ecx + CONST]": 208, "word [eax]": 209, "xadd dword [rdx + CONST]": 210, "byte [rsi + CONST]": 211, "byte [rcx]": 212, "byte [ecx + CONST]": 213, "qword [r9 + CONST]": 214, "[eax + CONST]": 215, "dword [r8 + CONST]": 216, "r13b": 217, "xmmword [rcx + CONST]": 218, "dword [rsi]": 219, "qword [rbp]": 220, "cdqe": 221, "xmm7": 222, "rol": 223, "[bp + CONST]": 224, "word [rcx]": 225, "[rax + rax*CONST]": 226, "sp": 227, "[r15 + CONST]": 228, "byte [rdx + CONST]": 229, "rep": 230, "xmmword [rax + CONST]": 231, "qword [r12]": 232, "word es:[bx + CONST]": 233, "r9w": 234, "mul": 235, "byte [edx + CONST]": 236, "[r11 + CONST]": 237, "byte [rdx]": 238, "qword [r13 + CONST]": 239, "xadd dword [rbx + CONST]": 240, "st(1)": 241, "word [ecx]": 242, "byte [rdi]": 243, "byte [ecx]": 244, "[r13 + CONST]": 245, "dword [r15 + CONST]": 246, "r14w": 247, "byte [edi + CONST]": 248, "r10b": 249, "les": 250, "xmm4": 251, "word [rdi + CONST]": 252, "r12w": 253, "dword [r14]": 254, "adc": 255, "byte [edx]": 256, "word [CONST]": 257, "r15w": 258, "word [eax + CONST]": 259, "qword [ebp + CONST]": 260, "byte [edi]": 261, "qword [r10 + CONST]": 262, "word [esi]": 263, "xmm5": 264, "dword [eax*CONST + CONST]": 265, "ah": 266, "bts": 267, "div": 268, "setg": 269, "r10w": 270, "word [rcx + CONST]": 271, "[rax]": 272, "repne": 273, "r11b": 274, "[edx + CONST]": 275, "dword [r9 + CONST]": 276, "xchg": 277, "cmovb": 278, "qword [r13]": 279, "dword fs:[0]": 280, "byte [ebx]": 281, "r13w": 282, "idiv": 283, "word [rax + CONST]": 284, "mulss": 285, "movq": 286, "[r12 + CONST]": 287, "word [rbx]": 288, "dword [r8]": 289, "word [edx]": 290, "cmovle": 291, "cmovg": 292, "qword [r9]": 293, "qword [r12 + CONST]": 294, "word [rsi + CONST]": 295, "mulsd": 296, "xmmword [rax]": 297, "dword [r13 + CONST]": 298, "word [ebx]": 299, "word [rip + CONST]": 300, "dword [r10 + CONST]": 301, "byte [esp + CONST]": 302, "movapd": 303, "movd": 304, "btr": 305, "dword fs:[edx]": 306, "bh": 307, "byte [r8 + CONST]": 308, "word [esi + CONST]": 309, "dword [rbp]": 310, "word [rdx]": 311, "dword [r9]": 312, "pxor": 313, "[esi]": 314, "byte [rsi]": 315, "byte [r8]": 316, "cmovl": 317, "dword [r12 + CONST]": 318, "repe": 319, "dword [r11 + CONST]": 320, "ds": 321, "word [rdi]": 322, "[r10 + CONST]": 323, "xmm8": 324, "scasd eax": 325, "[rax + rcx*CONST]": 326, "r11w": 327, "[rsi]": 328, "byte [r14 + CONST]": 329, "cmova": 330, "st(0)": 331, "fild": 332, "[rbp]": 333, "dword [r15]": 334, "byte [r9 + CONST]": 335, "lcall": 336, "word [edi]": 337, "xmmword [rdx + CONST]": 338, "fldcw": 339, "addsd": 340, "qword [CONST]": 341, "qword [esp + CONST]": 342, "word [ebx + CONST]": 343, "word [ecx + CONST]": 344, "addss": 345, "word [rdx + CONST]": 346, "qword [r10]": 347, "cs": 348, "[rdi]": 349, "[rbx]": 350, "word [esp + CONST]": 351, "stosd": 352, "es": 353, "cmovns": 354, "[rcx]": 355, "xadd dword [rdi + CONST]": 356, "fnstsw": 357, "xmmword [rbx + CONST]": 358, "dh": 359, "dword [rsp]": 360, "qword [rsp]": 361, "word cs:[rax + rax]": 362, "CONST:CONST": 363, "word [rsi]": 364, "cmovs": 365, "wait": 366, "byte [r9]": 367, "byte es:[edi]": 368, "cmpsb byte [rsi]": 369, "byte ptr [rdi]": 370, "ucomisd": 371, "byte [r15 + CONST]": 372, "fxch": 373, "subsd": 374, "ch": 375, "[ecx*CONST + CONST]": 376, "word [r8]": 377, "dword [r13]": 378, "xmm9": 379, "cld": 380, "movsd dword es:[edi]": 381, "cvtsi2sd": 382, "word [rax + rcx*CONST]": 383, "xmmword [rcx]": 384, "[rcx + rcx*CONST]": 385, "byte [rcx + rax]": 386, "[rax*CONST]": 387, "word [edi + CONST]": 388, "[edi]": 389, "byte [r14]": 390, "dword [r12]": 391, "word es:[bx]": 392, "psrldq": 393, "qword [rcx + rax*CONST]": 394, "outsb": 395, "cvttss2si": 396, "cvtdq2ps": 397, "setb": 398, "[rax*CONST + CONST]": 399, "qword [rax + rcx*CONST]": 400, "[rdx + rdx*CONST]": 401, "scasb al": 402, "qword [r11]": 403, "[r12]": 404, "byte [esp]": 405, "dword [rdx + rcx]": 406, "fistp": 407, "dword [rdx + rcx + CONST]": 408, "dword [edx*CONST + CONST]": 409, "dword [rax + rcx*CONST + CONST]": 410, "cmovbe": 411, "sahf": 412, "byte [r12 + CONST]": 413, "comiss": 414, "byte [r13 + CONST]": 415, "dword [r10]": 416, "qword gs:[CONST]": 417, "[eax*CONST + CONST]": 418, "stosd dword es:[edi]": 419, "seta": 420, "xadd dword [rcx + CONST]": 421, "outsd": 422, "byte [r11 + CONST]": 423, "word [edx + CONST]": 424, "fnstcw": 425, "popal": 426, "qword [esp]": 427, "xmmword [rdi + CONST]": 428, "cmovo": 429, "divsd": 430, "retf": 431, "[rdx]": 432, "[edx + edx + CONST]": 433, "xmmword [rdx]": 434, "fmul": 435, "inc dword [rcx + CONST]": 436, "xmm10": 437, "byte [rbp]": 438, "xmmword [rdi]": 439, "xword [ebp + CONST]": 440, "word [r14 + CONST]": 441, "word [r9]": 442, "[eax*CONST]": 443, "ss": 444, "byte [r10]": 445, "dword [r11]": 446, "insb": 447, "cvttsd2si": 448, "[eax + eax*CONST]": 449, "[rcx + rax*CONST]": 450, "[rdx + rdx]": 451, "subss": 452, "xmmword [rbx]": 453, "qword [rax + rdx*CONST]": 454, "qword [rdx + rcx + CONST]": 455, "st(2)": 456, "je": 457, "dword [ecx*CONST + CONST]": 458, "dword [rbp + rax*CONST + CONST]": 459, "byte [r15]": 460, "[rbx + rbx*CONST]": 461, "byte [ebp]": 462, "[rax + rax]": 463, "arpl": 464, "ucomiss": 465, "dword fs:[CONST]": 466, "byte [r10 + CONST]": 467, "byte es:[bx + CONST]": 468, "byte [bp + CONST]": 469, "word [rcx + rax*CONST]": 470, "word [r8 + CONST]": 471, "qword [eax + CONST]": 472, "setns": 473, "dword [rax + rcx*CONST]": 474, "xmmword [r11 + CONST]": 475, "cvtps2pd": 476, "xadd dword [rsi + CONST]": 477, "xmm11": 478, "dword [rcx + rax + CONST]": 479, "insd": 480, "byte [rdx + rax]": 481, "dword [eax + esi*CONST]": 482, "int": 483, "dword [eax + edi*CONST]": 484, "byte [r12]": 485, "dword [ecx + edx*CONST]": 486, "word [r10]": 487, "[rdi + rdi*CONST]": 488, "dword [edx + eax]": 489, "[rdx*CONST + CONST]": 490, "dword [rdx + rax*CONST + CONST]": 491, "qword [rbp + rax*CONST + CONST]": 492, "dword [ebp]": 493, "stosb byte [rdi]": 494, "dword [edx + eax*CONST]": 495, "xmmword [rdx + rcx + CONST]": 496, "[esp]": 497, "qword [rax + rcx*CONST + CONST]": 498, "setl": 499, "[r8 + r8*CONST]": 500, "xmmword [esi + CONST]": 501, "xmmword [edi + CONST]": 502, "[rdx + rcx]": 503, "xadd dword [rcx]": 504, "word [r14]": 505, "word [r9 + CONST]": 506, "bswap": 507, "[rax + rdx]": 508, "dword [eax + ecx*CONST + CONST]": 509, "[rax + rdx*CONST]": 510, "byte [rax + rcx + CONST]": 511, "xmmword [rsi + CONST]": 512, "[edx + edx*CONST]": 513, "dword [rbp + rdx*CONST + CONST]": 514, "pause": 515, "[rdx + rax*CONST]": 516, "seto": 517, "fucompp": 518, "[r9 + r9*CONST]": 519, "dword fs:[ecx]": 520, "movnti": 521, "word [r15 + CONST]": 522, "cmovge": 523, "qword [rax + rsi*CONST]": 524, "byte [rax + rbx]": 525, "bsr": 526, "comisd": 527, "xmm12": 528, "[rcx*CONST + CONST]": 529, "fldz": 530, "cwde": 531, "byte [r10 + r9 + CONST]": 532, "setbe": 533, "xmmword [r8 + CONST]": 534, "pmovmskb": 535, "[rax + rsi*CONST]": 536, "[eax + ecx*CONST]": 537, "byte [rax + r8]": 538, "qword [rdx + rax*CONST]": 539, "word [rbx + rax*CONST]": 540, "[r8]": 541, "dword [ebx + esi*CONST]": 542, "xmm13": 543, "byte [rdx + r8]": 544, "xmmword [r8]": 545, "fmulp": 546, "word [r10 + CONST]": 547, "byte [rcx + rdx]": 548, "[rbx + rax*CONST]": 549, "qword [rcx + rax + CONST]": 550, "byte es:[di]": 551, "[rcx + rdx*CONST]": 552, "pcmpeqb": 553, "byte [rax + rbp + CONST]": 554, "minss": 555, "[rcx*CONST]": 556, "fadd": 557, "[rdi + rax*CONST]": 558, "xmmword [rsi]": 559, "fdiv": 560, "[ecx + eax*CONST]": 561, "add dword [rdx + CONST]": 562, "qword [eax]": 563, "inc dword [rbx + CONST]": 564, "dword [edx + eax*CONST + CONST]": 565, "byte [rax + rdx + CONST]": 566, "qword [rcx + rbx + CONST]": 567, "dword [eax + ecx*CONST]": 568, "word [esp]": 569, "dword [rax + rcx + CONST]": 570, "byte [rcx + rax + CONST]": 571, "divss": 572, "inc dword [rax + CONST]": 573, "byte ptr es:[edi]": 574, "dword [ebx*CONST + CONST]": 575, "[rcx + rdx]": 576, "qword [rcx + rsi + CONST]": 577, "byte [rdx + rcx + CONST]": 578, "dword [rdx + rax*CONST]": 579, "byte [rsp + rax + CONST]": 580, "dword [eax + ebx*CONST]": 581, "cmpsb byte [esi]": 582, "byte [r13]": 583, "byte [r11]": 584, "fdivp": 585, "bound": 586, "cvtsd2ss": 587, "qword [rcx + rdi + CONST]": 588, "word [r13 + CONST]": 589, "stosd dword [rdi]": 590, "word [rax + rcx*CONST + CONST]": 591, "dword [ecx + edx*CONST + CONST]": 592, "[rax + rdi*CONST]": 593, "dword [esi*CONST + CONST]": 594, "dword [ebx + eax*CONST]": 595, "byte [rdx + rax + CONST]": 596, "dword [rbp + rcx*CONST + CONST]": 597, "setge": 598, "byte [rdx + rcx]": 599, "byte [rcx + rbp]": 600, "fld1": 601, "dword [edi + ecx*CONST + CONST]": 602, "[r13]": 603, "cmpxchg dword [rip + CONST]": 604, "cvtsi2ss": 605, "byte [rcx + rdx + CONST]": 606, "faddp": 607, "word cs:[CONST]": 608, "byte [esi + eax + CONST]": 609, "xadd dword [eax]": 610, "ja": 611, "dword [ecx + eax*CONST]": 612, "xmmword [rbp]": 613, "[rdx + rax]": 614, "byte ptr [esi]": 615, "xmm14": 616, "word [r15]": 617, "[rdi + rdi]": 618, "byte [rbx + rax]": 619, "dword [rcx + rdi + CONST]": 620, "[edi + edi]": 621, "qword [rax + rdx*CONST + CONST]": 622, "[r10 + r10*CONST]": 623, "dword [esi + ecx*CONST + CONST]": 624, "byte es:[bx]": 625, "qword [rcx + rax]": 626, "qword [r14 + rbx*CONST]": 627, "qword [rbx + rax*CONST]": 628, "[rdx + rcx*CONST]": 629, "word [r12]": 630, "[rsi + rsi*CONST]": 631, "[r15]": 632, "word es:[edi]": 633, "cqo": 634, "xorpd": 635, "[ecx]": 636, "byte [eax + ecx]": 637, "xmmword [r14 + CONST]": 638, "byte [r9 + rdx]": 639, "[r9 + rcx*CONST]": 640, "[r14 + r14]": 641, "[rdx + rbp]": 642, "dword [rcx + rax*CONST + CONST]": 643, "dword [rcx + rax]": 644, "dword [rax + rdx + CONST]": 645, "cpuid": 646, "xmmword [r9 + CONST]": 647, "[rax + rcx]": 648, "[rcx + rcx]": 649, "stosq qword [rdi]": 650, "xmmword [r14]": 651, "out": 652, "byte [si]": 653, "byte [rax + rsi + CONST]": 654, "qword [rdx + rcx*CONST]": 655, "qword [rax + rdi*CONST]": 656, "qword [rax + r8*CONST]": 657, "add dword [rbx + CONST]": 658, "byte [eax + edx]": 659, "dword [edi*CONST + CONST]": 660, "[edx + eax*CONST]": 661, "[rbx + rax]": 662, "xmmword [rdx + rcx]": 663, "dword [edi + esi*CONST]": 664, "[r9]": 665, "cmpxchg dword [esi]": 666, "dword [rcx + rsi + CONST]": 667, "jne": 668, "[edx + edx]": 669, "cvtss2sd": 670, "xmmword [rcx + rdx + CONST]": 671, "dword [rcx + rbx + CONST]": 672, "movsb byte es:[edi]": 673, "qword [rax + rbx*CONST]": 674, "[eax + edx + CONST]": 675, "inc dword [rax]": 676, "word [rdi + rax*CONST]": 677, "[rcx + rax + CONST]": 678, "[ebx + ebx*CONST]": 679, "word [rdx + rax*CONST]": 680, "dword [eax + edx*CONST]": 681, "stosb": 682, "byte [rax + rbx + CONST]": 683, "qword [rsi + rax]": 684, "[ebx]": 685, "xadd dword [rax]": 686, "qword [rdi + rsi + CONST]": 687, "dword [ebp + edx*CONST + CONST]": 688, "[rbx + rbx]": 689, "xmmword [r15]": 690, "vmulsd": 691, "[ecx + ecx*CONST]": 692, "byte [eax + edi + CONST]": 693, "qword [rax + rdi + CONST]": 694, "cvtdq2pd": 695, "qword [rdx + rcx]": 696, "byte [rax + rdi]": 697, "dword [rbp + r9*CONST + CONST]": 698, "byte [rax + rcx]": 699, "[rax + r14*CONST]": 700, "xadd dword [ecx]": 701, "xword [esp]": 702, "byte [rcx + r8 + CONST]": 703, "byte [eax + esi + CONST]": 704, "byte [rax + rdi + CONST]": 705, "[rsi + rax]": 706, "[edx + eax]": 707, "lds": 708, "[rax + rax + CONST]": 709, "[eax + eax]": 710, "in": 711, "fucomi": 712, "qword [rsp + rcx + CONST]": 713, "dword [rsp + rcx + CONST]": 714, "dword [ebp + ecx*CONST + CONST]": 715, "word [rsi + rax*CONST]": 716, "[esi + esi*CONST]": 717, "[rdx*CONST]": 718, "bsf": 719, "byte [esi + ecx + CONST]": 720, "[ebx + ebx + CONST]": 721, "[rsi + rsi]": 722, "qword [rax + rcx + CONST]": 723, "byte [rdi + rax]": 724, "xmmword [r15 + CONST]": 725, "[eax + edx*CONST]": 726, "cmpxchg qword [rip + CONST]": 727, "dword [ecx + eax]": 728, "byte [eax + edi]": 729, "qword [rcx + rdx*CONST]": 730, "dword [rax + rbx*CONST]": 731, "xmmword [r9]": 732, "[r14 + r14*CONST]": 733, "[r9 + rax*CONST]": 734, "lodsb": 735, "qword [rbx + rdi*CONST + CONST]": 736, "word [r13]": 737, "cmpsd dword [rsi]": 738, "dword ptr [rdi]": 739, "[r14]": 740, "[rbp*CONST + CONST]": 741, "setae": 742, "[rax + rdx*CONST + CONST]": 743, "fchs": 744, "movntps": 745, "[r10]": 746, "fucom": 747, "dword [rcx + rdx + CONST]": 748, "xmmword [edi]": 749, "byte [eax + ebx + CONST]": 750, "xmmword [r10]": 751, "[esi + eax*CONST]": 752, "word ss:[bx + CONST]": 753, "word [eax + ebx*CONST + CONST]": 754, "dword [rbp + r8*CONST + CONST]": 755, "[rsi*CONST + CONST]": 756, "[r10 + rdx]": 757, "[rcx + rax]": 758, "dword [r8 + rcx*CONST + CONST]": 759, "word [rax + rbx*CONST]": 760, "byte [rax + r9]": 761, "xword [CONST]": 762, "byte [esi + edi]": 763, "cvtpd2ps": 764, "setle": 765, "qword [rax + r15*CONST + CONST]": 766, "byte [r15 + rax]": 767, "[eax + esi*CONST]": 768, "dword [ebp + eax*CONST + CONST]": 769, "word [rcx + rax*CONST + CONST]": 770, "sets": 771, "[edi + eax*CONST]": 772, "dword [rsi + rax*CONST + CONST]": 773, "[r8 + rax*CONST]": 774, "byte [rbp + rbx + CONST]": 775, "dword [ebp + esi*CONST + CONST]": 776, "word [eax + eax + CONST]": 777, "byte [eax + eax + CONST]": 778, "word [rcx + rdx*CONST]": 779, "qword [rsi + rcx]": 780, "byte ptr [rsi]": 781, "[rcx + r8]": 782, "qword [rax + r13*CONST]": 783, "[rsi + rdi]": 784, "pushfd": 785, "qword [r8 + rdx*CONST]": 786, "ss:[CONST]": 787, "byte [eax + esi]": 788, "xmm15": 789, "stmxcsr": 790, "cmpxchg dword [edx]": 791, "[rax + rbp*CONST]": 792, "add dword [rdi + CONST]": 793, "[rdx + r8]": 794, "byte [ecx + eax + CONST]": 795, "[rbp*CONST]": 796, "st(3)": 797, "byte [rbx + rax + CONST]": 798, "byte [rsp + rcx + CONST]": 799, "[rsi + rax*CONST]": 800, "palignr": 801, "qword [rcx + rdx*CONST + CONST]": 802, "[rax + rbx*CONST]": 803, "dword [ebp + eax + CONST]": 804, "dword [eax + ecx + CONST]": 805, "xmmword [rsp]": 806, "dword [ecx + ebx*CONST]": 807, "byte [edi + edx + CONST]": 808, "word [esi + ebx*CONST + CONST]": 809, "dword [rax + rdx*CONST + CONST]": 810, "qword [rdi + rax]": 811, "dword [eax + ecx]": 812, "byte [r10 + r9]": 813, "[r8 + rax]": 814, "por": 815, "dword [rdx + rax]": 816, "dword [eax + edx*CONST + CONST]": 817, "[ecx + eax + CONST]": 818, "[rax + rcx*CONST + CONST]": 819, "[ebx + ebx]": 820, "byte [rsp + rdx + CONST]": 821, "dword [edx + esi*CONST]": 822, "dword [rcx + rdx*CONST + CONST]": 823, "byte [r8 + rax]": 824, "[r15 + rax*CONST]": 825, "[rbx + rax + CONST]": 826, "andpd": 827, "fucomp": 828, "fcomp": 829, "shrd": 830, "[r8*CONST]": 831, "byte [rax + rdx]": 832, "[rax + rax*CONST + CONST]": 833, "byte [rsi + rax + CONST]": 834, "dword [rax + rdx*CONST]": 835, "dword [edx + ecx*CONST]": 836, "byte [esi + ebx + CONST]": 837, "cmpxchg dword [edi]": 838, "[eax + edi*CONST]": 839, "qword [rax + r15*CONST]": 840, "qword [esi]": 841, "[r13*CONST]": 842, "[rbx + rdi]": 843, "ymm1": 844, "dword [rax + rdi + CONST]": 845, "dword [rcx + rax*CONST]": 846, "qword [r8 + rax*CONST]": 847, "[rsi + rcx]": 848, "word [r8 + rcx]": 849, "[CONST]": 850, "word [r11 + CONST]": 851, "[rbx + rsi]": 852, "pcmpistri": 853, "qword [rcx + rbx*CONST]": 854, "[esi + esi]": 855, "byte [rsi + rax]": 856, "[rax + rcx + CONST]": 857, "byte [rdi + rbx]": 858, "pshufd": 859, "pcmpeqw": 860, "dword [r8 + rax*CONST + CONST]": 861, "[r8 + rcx*CONST]": 862, "dword [esi + ecx*CONST]": 863, "fst": 864, "dword [rax + rdi*CONST]": 865, "xmmword [CONST]": 866, "inc dword [rdi + CONST]": 867, "dword [ebp + ebx*CONST + CONST]": 868, "prefetchnta": 869, "[ebx + eax*CONST]": 870, "byte [rdx + rbx]": 871, "[esi*CONST + CONST]": 872, "qword [rbx + rax]": 873, "word ptr [esi]": 874, "[esi + ecx*CONST]": 875, "dword [rcx + rdx*CONST]": 876, "qword [rcx + rax*CONST + CONST]": 877, "movsb": 878, "[eax + ebx + CONST]": 879, "[rdi + rbx]": 880, "fs": 881, "gs": 882, "xword [rbp + CONST]": 883, "[r8 + r9]": 884, "byte [edx + eax]": 885, "dword [eax + ebx + CONST]": 886, "xmmword [ecx + CONST]": 887, "byte [rcx + rsi + CONST]": 888, "word [eax*CONST + CONST]": 889, "xadd dword [r14 + CONST]": 890, "qword [rdi + rbx*CONST]": 891, "[rbx*CONST]": 892, "byte [eax + edx + CONST]": 893, "[r12 + r12*CONST]": 894, "word [eax + ecx*CONST]": 895, "dword [edi + ebx*CONST]": 896, "qword [rdx + rax + CONST]": 897, "[esi + eax + CONST]": 898, "vmovq": 899, "[edi + edi*CONST]": 900, "[rbx + r14*CONST]": 901, "[r12 + r12]": 902, "qword [rbx + rdi + CONST]": 903, "[r11 + r11*CONST]": 904, "word [rdx + rcx]": 905, "fdivrp": 906, "qword [rbx + rdi*CONST]": 907, "[ebx + edx]": 908, "byte [rcx + rdi + CONST]": 909, "word [rax + r8 + CONST]": 910, "qword [rsi + rdi*CONST]": 911, "qword [r8 + r13*CONST + CONST]": 912, "[rsi*CONST]": 913, "byte [ecx + esi + CONST]": 914, "qword [rbp + rsi*CONST]": 915, "[eax + esi + CONST]": 916, "word [rdi + rcx*CONST]": 917, "byte [rax + rsi]": 918, "movsw": 919, "dword [eax + edi + CONST]": 920, "[r14 + rdx]": 921, "dword [rbx + rax]": 922, "qword [rdx + rax*CONST + CONST]": 923, "[rax + r8 + CONST]": 924, "vsubsd": 925, "[edi*CONST + CONST]": 926, "byte [eax + ecx + CONST]": 927, "qword [rsi + rbx*CONST]": 928, "xmmword [esi]": 929, "std": 930, "[r8 + rdx]": 931, "fucomip": 932, "[rbx + rdi*CONST]": 933, "dword [r9 + r8*CONST]": 934, "word [r12 + CONST]": 935, "dword [eax + esi*CONST + CONST]": 936, "byte [rax + r8 + CONST]": 937, "[edx*CONST]": 938, "dword [r8 + rcx*CONST]": 939, "dword [r14 + rbx + CONST]": 940, "byte [edx + ecx]": 941, "byte [ecx + eax]": 942, "[r9 + r9]": 943, "[rsi + rcx*CONST]": 944, "qword [ecx]": 945, "word [rax + rdi*CONST]": 946, "word [rax + rdx*CONST]": 947, "[rax + r12*CONST]": 948, "qword [r9 + rax*CONST]": 949, "[edx*CONST + CONST]": 950, "dword [ebx + edi*CONST]": 951, "byte [rbx + rdi]": 952, "byte [rbx + rcx]": 953, "dword [ebx + eax*CONST + CONST]": 954, "dword [ecx + eax*CONST + CONST]": 955, "dword [rdx + rcx*CONST + CONST]": 956, "byte [ecx + edx]": 957, "[r14 + rsi]": 958, "dword [rsp + rax*CONST + CONST]": 959, "[eax + ebx]": 960, "qword [rax + r9*CONST]": 961, "byte [r8 + rax + CONST]": 962, "byte [ecx + ebx + CONST]": 963, "byte [rbx + rdx]": 964, "dword [rsp + rdx + CONST]": 965, "xword [rsp + CONST]": 966, "qword [rax + r12*CONST]": 967, "dword [ebp + edi*CONST + CONST]": 968, "[esi*CONST]": 969, "[r8 + rcx]": 970, "dword [esi + eax]": 971, "[r9*CONST]": 972, "byte [rcx + r8]": 973, "[rdx + rsi]": 974, "[r8 + rbx]": 975, "dword [rax + rcx]": 976, "xadd dword [rip + CONST]": 977, "byte [r9 + rcx]": 978, "movsb byte [rdi]": 979, "vfmadd213sd": 980, "byte [rbx + rsi]": 981, "[r14 + rax*CONST]": 982, "qword [rax + r10 + CONST]": 983, "[eax + edi]": 984, "byte [edx + eax + CONST]": 985, "qword [rax + rbp*CONST]": 986, "[ecx + edi]": 987, "byte [ebx + eax + CONST]": 988, "[ebp + eax*CONST + CONST]": 989, "byte [rdi + rax + CONST]": 990, "qword [r15 + rax*CONST]": 991, "[rax + rbx]": 992, "[rax + r8]": 993, "[rcx + rbx*CONST]": 994, "qword [r12 + rax*CONST]": 995, "byte [rcx + rdi]": 996, "[rdx + rdi]": 997, "[rcx + r9]": 998, "[eax + ecx]": 999, "word [rbp]": 1000, "[rdi + rbp]": 1001, "byte [esi + eax]": 1002, "word [r11]": 1003, "dword [rax + r10 + CONST]": 1004, "stosw": 1005, "byte [bx + CONST]": 1006, "qword [r14 + rbx + CONST]": 1007, "byte [r12 + rax]": 1008, "qword [rcx + rdx + CONST]": 1009, "dword [rax + rbx + CONST]": 1010, "inc dword [rsi + CONST]": 1011, "[r14 + rdi]": 1012, "[r12 + rax*CONST]": 1013, "qword [rdx + rax]": 1014, "word [r8 + rcx*CONST + CONST]": 1015, "qword [r14 + rsi*CONST]": 1016, "[r14*CONST + CONST]": 1017, "dword [eax + edx + CONST]": 1018, "dword [edi + ecx*CONST]": 1019, "qword [r12 + rdi*CONST]": 1020, "word [ecx + eax*CONST]": 1021, "qword [rcx + r8*CONST]": 1022, "dword [rsi + rax]": 1023, "[ecx + esi*CONST]": 1024, "[ecx + esi + CONST]": 1025, "byte [bx + si]": 1026, "qword [rdx + r8*CONST]": 1027, "[ebx + edi]": 1028, "word [eax + edi*CONST + CONST]": 1029, "qword [rax + rsi]": 1030, "[rsi + rbx]": 1031, "byte [ebp + eax + CONST]": 1032, "fsub": 1033, "[r9 + r8*CONST]": 1034, "inc dword [rdx + CONST]": 1035, "byte [di]": 1036, "qword [r12 + rsi*CONST]": 1037, "[r9 + rdx*CONST]": 1038, "dword [edi + eax]": 1039, "byte [rax + r14 + CONST]": 1040, "dword [ecx + edi*CONST]": 1041, "word [rax + r10*CONST + CONST]": 1042, "add dword [rax]": 1043, "qword [rbx + rdx*CONST + CONST]": 1044, "qword [r14 + rbp*CONST + CONST]": 1045, "xmmword [esp + CONST]": 1046, "[r15 + rbp]": 1047, "xmmword [r12]": 1048, "qword [rax + rsi + CONST]": 1049, "[edx + ecx*CONST]": 1050, "[rcx + rdi*CONST]": 1051, "rdtsc": 1052, "[r14 + rcx*CONST]": 1053, "[r15 + rax]": 1054, "dword [rcx + rbx*CONST]": 1055, "[eax + ecx + CONST]": 1056, "dword [ebx + esi + CONST]": 1057, "qword [r14 + rax]": 1058, "[ecx + edx]": 1059, "qword [rax + rbx + CONST]": 1060, "[r15*CONST]": 1061, "pshuflw": 1062, "dword [eax + esi]": 1063, "qword [rax + rbx]": 1064, "[rcx + rsi]": 1065, "word ss:[CONST]": 1066, "dword [rax + r8*CONST]": 1067, "byte [rax + r15]": 1068, "byte [eax + ebx]": 1069, "[ebx*CONST + CONST]": 1070, "[r15 + r15]": 1071, "[ecx + edx*CONST]": 1072, "rcr": 1073, "dword [rbx + rcx*CONST + CONST]": 1074, "word [bx + CONST]": 1075, "dword [edi + edx*CONST]": 1076, "dword [ecx + eax + CONST]": 1077, "[rdx + r9]": 1078, "byte [rbp + rbx]": 1079, "xadd qword [rcx + CONST]": 1080, "byte [rbx + rdi + CONST]": 1081, "qword [rdx + rbx + CONST]": 1082, "[r9 + rdx]": 1083, "byte [rcx + rbx]": 1084, "js": 1085, "byte [r8 + rdx]": 1086, "[ecx + ebx]": 1087, "vmovsd": 1088, "vfmadd231sd": 1089, "qword [rax + rcx]": 1090, "dword [ebx + edx + CONST]": 1091, "cmpsd dword [esi]": 1092, "dword ptr es:[edi]": 1093, "dword [edx + edi*CONST]": 1094, "dword [eax + edi*CONST + CONST]": 1095, "xmmword [rcx + rdx]": 1096, "[eax + esi]": 1097, "byte [r8 + rcx]": 1098, "dword [ecx + edx + CONST]": 1099, "[ebp]": 1100, "[rdi + rbx*CONST]": 1101, "byte [rsi + rbx]": 1102, "qword [rsi + rax*CONST]": 1103, "dword [rax + r8*CONST + CONST]": 1104, "byte [rax + r14]": 1105, "[rcx + rsi*CONST]": 1106, "dword [rdi + rcx*CONST]": 1107, "dword [rbx + rax + CONST]": 1108, "[rdi + rax]": 1109, "[rax + r13*CONST]": 1110, "dword [rsp + rcx*CONST + CONST]": 1111, "byte [rax + rcx*CONST + CONST]": 1112, "[r11 + r9]": 1113, "[r11]": 1114, "qword [rax + rdx + CONST]": 1115, "[esi + edi]": 1116, "qword [rdi + r10*CONST]": 1117, "ldmxcsr": 1118, "word [r9 + rax*CONST]": 1119, "word [rsi + rbx*CONST]": 1120, "dword [rbp + rdi*CONST + CONST]": 1121, "qword [ebx]": 1122, "byte [rcx + rbp + CONST]": 1123, "[rax + rsi]": 1124, "word [rdx + rcx*CONST]": 1125, "[rax + r15*CONST]": 1126, "[rbx + rcx*CONST]": 1127, "dword [ecx + edx]": 1128, "[r14*CONST]": 1129, "word [ebp + eax + CONST]": 1130, "qword [r12 + rbx*CONST]": 1131, "byte [rcx + rbx + CONST]": 1132, "[rax + rdx + CONST]": 1133, "dword [ebx + ecx*CONST + CONST]": 1134, "byte [edi + eax + CONST]": 1135, "[ebx + esi*CONST]": 1136, "qword [rdx + rcx*CONST + CONST]": 1137, "[rbx + rbp*CONST]": 1138, "word [ecx + edi*CONST]": 1139, "[edx + ecx]": 1140, "dword [rcx + r9 + CONST]": 1141, "fcompp": 1142, "word [r8 + rax*CONST]": 1143, "byte [rbx + r8]": 1144, "[eax + ebx*CONST]": 1145, "dword [rdi + rax]": 1146, "fcom": 1147, "dword [0]": 1148, "dword [ebx + edx*CONST]": 1149, "shld": 1150, "qword [r14 + rax*CONST]": 1151, "byte [rbx + rcx + CONST]": 1152, "byte [r9 + r8 + CONST]": 1153, "byte [edi + esi + CONST]": 1154, "byte [rsi + rcx + CONST]": 1155, "qword [r10 + r13*CONST + CONST]": 1156, "rcl": 1157, "shufps": 1158, "word [r15 + rcx*CONST + CONST]": 1159, "byte [edi + edx]": 1160, "qword [rbp + rax + CONST]": 1161, "fsubp": 1162, "byte [rdx + rax*CONST + CONST]": 1163, "dword [ecx + esi*CONST]": 1164, "qword [rcx + rsi*CONST]": 1165, "dword [edi + eax*CONST + CONST]": 1166, "word [eax + ebx*CONST]": 1167, "psrlq": 1168, "xmmword [r11]": 1169, "dword [esi + eax*CONST]": 1170, "qword [r14 + rdi*CONST]": 1171, "[esi + ecx]": 1172, "[edi + edi + CONST]": 1173, "[rdi*CONST]": 1174, "word [rcx + rax]": 1175, "qword [rax + r14*CONST]": 1176, "qword [ebx + CONST]": 1177, "qword [rcx + rdi*CONST]": 1178, "byte [edi + esi]": 1179, "[rax + rdi]": 1180, "word [ebp + eax*CONST + CONST]": 1181, "[r8 + r9*CONST]": 1182, "dword [rax + rsi*CONST]": 1183, "[rcx + r8*CONST]": 1184, "[rbx + rdx]": 1185, "xword [esp + CONST]": 1186, "[ecx + ecx]": 1187, "byte [rdx + r9]": 1188, "byte [rdx + rdi]": 1189, "cmc": 1190, "[rcx + rbp]": 1191, "xmmword [r10 + CONST]": 1192, "dword [esi + edi*CONST + CONST]": 1193, "qword [rbx + rax*CONST + CONST]": 1194, "[r8 + r8]": 1195, "word [rbx + rsi]": 1196, "or dword [rbx + CONST]": 1197, "qword [r15 + rcx]": 1198, "[r8 + rdx*CONST]": 1199, "qword [r11 + rdx*CONST]": 1200, "dword [rbx + rax*CONST + CONST]": 1201, "qword [r8 + r15*CONST + CONST]": 1202, "dword [r14 + rbp*CONST + CONST]": 1203, "dword [ecx + ebx + CONST]": 1204, "dword [rbx + rcx*CONST]": 1205, "[rdx + r8*CONST]": 1206, "qword [rdx + r8*CONST + CONST]": 1207, "[rdi + rsi]": 1208, "xmmword [rax + rdx + CONST]": 1209, "byte [r11 + r9 + CONST]": 1210, "dword [rbp + r10*CONST + CONST]": 1211, "xadd dword [esi]": 1212, "[eax + eax + CONST]": 1213, "dword [esi + eax*CONST + CONST]": 1214, "[rdi + rax + CONST]": 1215, "dword [esi + edx + CONST]": 1216, "[rsi + r14]": 1217, "dword [esi + edi*CONST]": 1218, "qword [rdx + rsi*CONST]": 1219, "mulpd": 1220, "dword [rdi + rcx*CONST + CONST]": 1221, "[rbx + rsi*CONST]": 1222, "[r10 + rax*CONST]": 1223, "[ecx + edi + CONST]": 1224, "word [rdx + r8*CONST]": 1225, "dword [r14 + rax*CONST + CONST]": 1226, "qword [rbp + rdx*CONST + CONST]": 1227, "byte gs:[esi]": 1228, "byte [edx + ebx + CONST]": 1229, "dword [rcx + rdi*CONST]": 1230, "dword [rdi + rbx + CONST]": 1231, "dword [rdi + rax + CONST]": 1232, "byte [rax + r10 + CONST]": 1233, "word ss:[bx]": 1234, "es:[bx + CONST]": 1235, "[rbx + rbp]": 1236, "[r14 + rax]": 1237, "[rax + rbp]": 1238, "qword [rbx + rsi*CONST]": 1239, "[rbx + rax*CONST + CONST]": 1240, "dword [rdx + rbx*CONST]": 1241, "word [rcx + rdx]": 1242, "unpcklps": 1243, "qword [r15 + rdx*CONST]": 1244, "dword [rdx + r8*CONST]": 1245, "xword [rcx]": 1246, "word [rcx + rdi*CONST]": 1247, "dword [rbx + rax*CONST]": 1248, "[r8*CONST + CONST]": 1249, "stosb byte es:[edi]": 1250, "byte es:[si]": 1251, "qword [r13 + r14*CONST]": 1252, "[edi + esi*CONST]": 1253, "vaddsd": 1254, "qword [rdi + r12*CONST + CONST]": 1255, "qword [rcx + rdx]": 1256, "word [rcx + rax + CONST]": 1257, "dword [rbp + rdx + CONST]": 1258, "dword [rbx + rdi + CONST]": 1259, "jae": 1260, "frndint": 1261, "[edi*CONST]": 1262, "[r14 + rcx + CONST]": 1263, "byte [r9 + r10 + CONST]": 1264, "byte [esi + ebx]": 1265, "dword [edx + eax + CONST]": 1266, "[rdx + r14]": 1267, "vmovapd": 1268, "[rbx + r14]": 1269, "[rbx + r15*CONST]": 1270, "qword [esi + CONST]": 1271, "[eax + edi + CONST]": 1272, "[ecx*CONST]": 1273, "word [rax + rsi*CONST]": 1274, "qword [rax + rbp + CONST]": 1275, "dword [rax + rbx]": 1276, "dword [rax + rsi + CONST]": 1277, "[r15 + rcx]": 1278, "word [rax + rcx]": 1279, "qword [r15 + rcx*CONST]": 1280, "word [ecx + ebx*CONST]": 1281, "byte [r10 + rax]": 1282, "qword [rsp + rax + CONST]": 1283, "byte [rdx + r14]": 1284, "[r11 + r10*CONST]": 1285, "dword [rbp + r8 + CONST]": 1286, "[edx + eax + CONST]": 1287, "word [rbp + rbx + CONST]": 1288, "word [rsp + rax*CONST + CONST]": 1289, "xword [eax]": 1290, "[r15 + rbx]": 1291, "[r9 + r8]": 1292, "byte [edx + esi]": 1293, "byte [eax*CONST + CONST]": 1294, "[esi + ebx]": 1295, "dword [esi + ebx*CONST]": 1296, "[rdx + rax + CONST]": 1297, "[r15 + r14]": 1298, "dword [rsp + r8*CONST + CONST]": 1299, "qword [rcx + r13]": 1300, "dword [rdx + rcx*CONST]": 1301, "word [eax + edx*CONST]": 1302, "word [r13 + rcx*CONST + CONST]": 1303, "jg": 1304, "byte gs:[ecx + CONST]": 1305, "qword [ecx + edi*CONST + CONST]": 1306, "byte [ebp + esi + CONST]": 1307, "dword [r10 + r9*CONST]": 1308, "[ecx + eax]": 1309, "dword [rbx + rdx + CONST]": 1310, "dword [edi + eax + CONST]": 1311, "dword [edx + ecx + CONST]": 1312, "cmpxchg8b qword [edi]": 1313, "byte [r9 + rax*CONST]": 1314, "byte [rcx + r10]": 1315, "dword [ebx + edi + CONST]": 1316, "word [rdx + rax]": 1317, "dword [rdx + rax + CONST]": 1318, "dword [rbp + rax + CONST]": 1319, "[edx + esi]": 1320, "qword [r13 + rcx]": 1321, "dword [rbp + rbx + CONST]": 1322, "word [rcx + rdi*CONST + CONST]": 1323, "[rdi + rdx*CONST]": 1324, "[rbp + rbp*CONST]": 1325, "[ebx + ecx]": 1326, "[r15 + rdi]": 1327, "qword [r8 + rcx]": 1328, "dword [edi + eax*CONST]": 1329, "qword [r11 + rcx*CONST + CONST]": 1330, "[r9 + rcx]": 1331, "qword [rcx + rdi]": 1332, "[rdx + rdx*CONST + CONST]": 1333, "qword [rax + rdx]": 1334, "dword [r14 + rdi + CONST]": 1335, "word [eax + edi*CONST]": 1336, "dword [rax + r15*CONST]": 1337, "word [0]": 1338, "word [2]": 1339, "word [edi + esi*CONST]": 1340, "dword [r8 + rcx]": 1341, "[r12*CONST]": 1342, "byte [edx + esi*CONST + CONST]": 1343, "dword [eax + edi]": 1344, "byte ptr [si]": 1345, "and dword [rbx + CONST]": 1346, "xadd dword [r15 + CONST]": 1347, "word [ecx + edx*CONST]": 1348, "qword [r14 + rdx*CONST]": 1349, "[rdi + rcx]": 1350, "[rdi + r14]": 1351, "[rax + r8*CONST]": 1352, "qword [ecx + CONST]": 1353, "[r10 + r11*CONST]": 1354, "[r13 + rax + CONST]": 1355, "byte [rbp + rax + CONST]": 1356, "or dword [eax]": 1357, "word [rcx + rdx*CONST + CONST]": 1358, "qword [r14 + rbx]": 1359, "dword [rcx + r8*CONST]": 1360, "dec dword [rax]": 1361, "word [esi + eax*CONST + CONST]": 1362, "byte [edi + eax]": 1363, "[r8 + rsi]": 1364, "[rsp]": 1365, "[r14 + r13]": 1366, "[esi + ebx*CONST]": 1367, "dword [r13 + rax*CONST + CONST]": 1368, "qword [rdi + r15 + CONST]": 1369, "qword [r15 + r13*CONST]": 1370, "dword [rax + r14*CONST]": 1371, "[rax + r10*CONST]": 1372, "word [ebp]": 1373, "dword [esi + edx*CONST]": 1374, "dword [r9 + r8*CONST + CONST]": 1375, "xmmword [rdx + rax + CONST]": 1376, "word [rax + rdx]": 1377, "qword [rsp + rcx*CONST + CONST]": 1378, "[r14 + rbp]": 1379, "dword [r11 + r10*CONST + CONST]": 1380, "word [rcx + r8]": 1381, "cmpxchg dword [rbx + CONST]": 1382, "byte [ebx + edi + CONST]": 1383, "lodsw": 1384, "[r11 + r11]": 1385, "[r13 + rcx + CONST]": 1386, "byte [rdi + r8]": 1387, "dword [edx + edi*CONST + CONST]": 1388, "qword [rsi + rdi*CONST + CONST]": 1389, "byte [r11 + rax]": 1390, "[r14 + rbx]": 1391, "[rdi + rsi*CONST]": 1392, "[edi + esi]": 1393, "byte [rdx + rsi + CONST]": 1394, "dword [ebx + ecx*CONST]": 1395, "byte [rbx + r14]": 1396, "movsq qword [rdi]": 1397, "qword ptr [rsi]": 1398, "[rdx + r9*CONST]": 1399, "[ecx + esi]": 1400, "vzeroupper": 1401, "byte [ecx + edi]": 1402, "qword [edi]": 1403, "dword [r9 + rcx*CONST]": 1404, "byte [r11 + r9]": 1405, "word [r14 + rax*CONST]": 1406, "qword [rbx + rcx]": 1407, "[r14 + rdi*CONST]": 1408, "word [r9 + rdx*CONST]": 1409, "byte [r13 + rax + CONST]": 1410, "dec dword [rbx + CONST]": 1411, "psllq": 1412, "word [eax + edx*CONST + CONST]": 1413, "qword [rsi + rax + CONST]": 1414, "[rcx + rax*CONST + CONST]": 1415, "[edi + edx]": 1416, "[rsi + rbp*CONST]": 1417, "byte [rbp + rcx + CONST]": 1418, "[ebx + edx*CONST]": 1419, "[rdx + r10]": 1420, "[rax + r9]": 1421, "byte [rbx + rdx + CONST]": 1422, "xadd dword [rax + CONST]": 1423, "qword [r9 + rdx*CONST]": 1424, "[ebx + eax]": 1425, "qword [rdi + rax*CONST]": 1426, "[edi + ebx]": 1427, "dword [rax + rdx]": 1428, "byte [r14 + rax]": 1429, "dword [rax + rbp*CONST]": 1430, "xmmword [r13]": 1431, "byte [rax + rbp]": 1432, "dword [eax + eax]": 1433, "[r12*CONST + CONST]": 1434, "qword [rdi + rdx*CONST]": 1435, "dword [rdi + rax*CONST + CONST]": 1436, "xgetbv": 1437, "word [si]": 1438, "mulps": 1439, "[r12 + r13]": 1440, "[eax + edx]": 1441, "[rcx + rbx]": 1442, "[edi + edx*CONST]": 1443, "word [rsi + rdi*CONST]": 1444, "[rbx + r10]": 1445, "word [rax + r8]": 1446, "qword [r14 + r13*CONST]": 1447, "[esi + edx]": 1448, "qword [rsi + rdx]": 1449, "[rax + r12]": 1450, "xadd dword [edi]": 1451, "dword ptr [rsi]": 1452, "qword [rsi + rdx*CONST]": 1453, "byte [rdi + rsi + CONST]": 1454, "byte [bx]": 1455, "dword [rsp + rdx*CONST + CONST]": 1456, "jb": 1457, "xmmword [r8 + rcx + CONST]": 1458, "[ebx + ecx*CONST]": 1459, "dword [eax + ebx]": 1460, "sqrtss": 1461, "word [ecx + eax]": 1462, "byte [rdi + rcx + CONST]": 1463, "[r15 + rcx*CONST]": 1464, "dword [ebx + eax]": 1465, "dword [ebx + edx*CONST + CONST]": 1466, "dword [rbx + rdi*CONST + CONST]": 1467, "movlpd": 1468, "[rbx*CONST + CONST]": 1469, "dword [esi + ebx*CONST + CONST]": 1470, "qword [rax + rdi]": 1471, "[r9 + rdi*CONST]": 1472, "word [rdi + rbx*CONST]": 1473, "fsubr": 1474, "[rdi + r8]": 1475, "dword [rdi + rax*CONST]": 1476, "byte [rax + r13]": 1477, "qword [rcx + r14 + CONST]": 1478, "word [r8 + rdx*CONST]": 1479, "dword [r8 + rax*CONST]": 1480, "bnd": 1481, "qword [rdi + rcx*CONST + CONST]": 1482, "dword [rsi + rax + CONST]": 1483, "byte [rsp + rdi + CONST]": 1484, "[r14 + r8]": 1485, "[rbp + rax + CONST]": 1486, "byte [rsi + rdi]": 1487, "byte [r11 + r8]": 1488, "byte [ecx + eax*CONST + CONST]": 1489, "dword [r8 + rdx + CONST]": 1490, "xadd dword [edx]": 1491, "qword [rsp + rax*CONST + CONST]": 1492, "qword [r9 + rcx*CONST]": 1493, "cmpxchg qword [rbx]": 1494, "xmmword [rcx + rax + CONST]": 1495, "qword [rdi + rbx + CONST]": 1496, "[esi + edi*CONST]": 1497, "[edi + ecx*CONST]": 1498, "byte [edx + ecx + CONST]": 1499, "byte [rsi + r8]": 1500, "dword [rax + r11 + CONST]": 1501, "[esi + eax]": 1502, "[r10*CONST]": 1503, "[rbx + r13]": 1504, "word [ebx + eax*CONST + CONST]": 1505, "ffree": 1506, "punpcklbw": 1507, "[rbx + r12]": 1508, "cmpxchg dword [rbp + CONST]": 1509, "qword [rsp + rdx + CONST]": 1510, "byte [r14 + rsi]": 1511, "word [rsi + rdi]": 1512, "word [rbp + rax + CONST]": 1513, "[r10 + rcx*CONST]": 1514, "[eax + edx*CONST + CONST]": 1515, "word [edx + eax*CONST]": 1516, "word [r8 + rax]": 1517, "word [rbx + rdi]": 1518, "qword [r9 + rax*CONST + CONST]": 1519, "byte [rsp + rbx + CONST]": 1520, "xadd dword [ebx]": 1521, "[rsi + r13*CONST]": 1522, "[r14 + rcx]": 1523, "dword [ebp + ecx + CONST]": 1524, "word [r14 + rdi]": 1525, "byte [rax + r15 + CONST]": 1526, "qword [r15 + r14*CONST]": 1527, "qword [rdi + rcx + CONST]": 1528, "byte [rdi + r15 + CONST]": 1529, "[r12 + rbx]": 1530, "qword [rsi + rax*CONST + CONST]": 1531, "word [rdi + rbx]": 1532, "qword [r14 + rcx*CONST]": 1533, "qword [r9 + r15*CONST + CONST]": 1534, "dword [rcx + r8]": 1535, "word [rsp]": 1536, "xmmword [r14 + rbp*CONST + CONST]": 1537, "xmmword [edx + eax*CONST]": 1538, "dword [r12 + rbp + CONST]": 1539, "addps": 1540, "dword [rdx + rbx + CONST]": 1541, "byte [esi + ecx]": 1542, "jbe": 1543, "qword [rdx + r15 + CONST]": 1544, "vpmovmskb": 1545, "dword [rax + r9*CONST]": 1546, "qword [r8 + rcx*CONST]": 1547, "[r12 + rcx*CONST]": 1548, "xmmword [r12 + CONST]": 1549, "xmmword [rax + rcx]": 1550, "[r14 + rbp*CONST]": 1551, "cmpxchg dword [ebx]": 1552, "cmpxchg qword [rbx + CONST]": 1553, "[rdi + r15]": 1554, "dword [r9 + rcx + CONST]": 1555, "prefetchw": 1556, "vmovdqa": 1557, "word [rax + r9*CONST]": 1558, "[edx + edi]": 1559, "pand": 1560, "[ebx + edi*CONST]": 1561, "qword [r13 + rbx*CONST]": 1562, "qword [r12 + rcx*CONST]": 1563, "qword [rsi + rcx + CONST]": 1564, "qword [r10 + rax]": 1565, "byte [rcx + r9]": 1566, "byte [rdi + rax*CONST + CONST]": 1567, "byte [r14 + rax + CONST]": 1568, "dword [rdi + rsi + CONST]": 1569, "[rsi + rbp]": 1570, "[rcx + rdi]": 1571, "xmmword [ecx]": 1572, "[rcx + r8 + CONST]": 1573, "ymm2": 1574, "[rcx + r14]": 1575, "[r11 + rax*CONST]": 1576, "dword [rcx + rdx]": 1577, "byte [ecx + ebx]": 1578, "byte [rdi + rbp]": 1579, "[r13 + r13]": 1580, "[rdx + r11]": 1581, "byte [esi + edx]": 1582, "dword [eax + ebx*CONST + CONST]": 1583, "dword [r10 + rax*CONST]": 1584, "[rdx + rax*CONST + CONST]": 1585, "dword [esi + ecx]": 1586, "[r8 + rax + CONST]": 1587, "dword [esi + ebp + CONST]": 1588, "word [rsi + rbx]": 1589, "[rdx + rdi*CONST]": 1590, "[rdi*CONST + CONST]": 1591, "[rdi + rdx]": 1592, "qword [rcx + r15 + CONST]": 1593, "[r15*CONST + CONST]": 1594, "[r9 + rbx]": 1595, "or byte [rsp]": 1596, "inc dword [rbx]": 1597, "dword [r8 + rax]": 1598, "inc dword [r8 + CONST]": 1599, "qword [rdx + rbx*CONST]": 1600, "qword [rbp + rdi*CONST]": 1601, "byte [rdi + rsi]": 1602, "[ecx + ebx*CONST]": 1603, "[ebx*CONST]": 1604, "word [esi + ecx*CONST + CONST]": 1605, "qword [edx + CONST]": 1606, "qword [rax + r13]": 1607, "byte [rbx + rsi + CONST]": 1608, "byte [r10 + rax + CONST]": 1609, "word [rax + r8*CONST]": 1610, "word [rsp + rax + CONST]": 1611, "[ecx + edi*CONST]": 1612, "dword [r9 + rcx*CONST + CONST]": 1613, "[r10 + rax + CONST]": 1614, "[edi + ecx]": 1615, "byte [rax + rbx*CONST]": 1616, "word [eax + ecx]": 1617, "byte gs:[ebx + CONST]": 1618, "byte [di + CONST]": 1619, "byte gs:[edx]": 1620, "[rdx + r8 + CONST]": 1621, "word [r10 + rax*CONST]": 1622, "qword [rsp + rdx*CONST + CONST]": 1623, "[ebp + ebx*CONST + CONST]": 1624, "fnclex": 1625, "qword [rdx + r14 + CONST]": 1626, "[rsi + r14*CONST]": 1627, "qword [r12 + rcx*CONST + CONST]": 1628, "word [r14 + rdi + CONST]": 1629, "byte [esi + edi + CONST]": 1630, "[rbx + r9]": 1631, "[ebx + esi]": 1632, "byte [r11 + rcx]": 1633, "byte [ecx + eax*CONST]": 1634, "qword [r13 + rax*CONST]": 1635, "qword [rbp + rcx + CONST]": 1636, "dword [rbx + rsi + CONST]": 1637, "word [rdi + r15 + CONST]": 1638, "[r8 + r10*CONST]": 1639, "dword [rsi + rcx*CONST + CONST]": 1640, "dword [rsp + r15 + CONST]": 1641, "qword [r9 + r13*CONST + CONST]": 1642, "word ss:[di]": 1643, "[rax + r11*CONST]": 1644, "word [eax + esi*CONST + CONST]": 1645, "byte [r8 + rcx + CONST]": 1646, "dword [esp + edi*CONST + CONST]": 1647, "qword [rbp + rbx*CONST]": 1648, "qword [rbx + rdi]": 1649, "[r15 + r15*CONST]": 1650, "[r10 + r9]": 1651, "dword [rax + r8]": 1652, "word [eax + esi*CONST]": 1653, "word [rsi + rax]": 1654, "stc": 1655, "byte [r9 + r11 + CONST]": 1656, "qword [rax + r10]": 1657, "[rdi + rbp*CONST]": 1658, "word [rdi + rsi*CONST]": 1659, "[r8 + r14]": 1660, "dword [eax + esi + CONST]": 1661, "dword [r14 + rax]": 1662, "[r13 + rcx*CONST]": 1663, "qword [rdi + rcx]": 1664, "dword [r14 + rdx*CONST]": 1665, "qword [r8 + rcx + CONST]": 1666, "vandpd": 1667, "word es:[0]": 1668, "byte [r13 + rcx + CONST]": 1669, "qword [rdi + rax + CONST]": 1670, "dword [esi + eax + CONST]": 1671, "byte [r8 + rbx]": 1672, "word [edx + eax*CONST + CONST]": 1673, "qword [r14 + rdi]": 1674, "[r12 + rdi]": 1675, "qword [r10 + rdx*CONST]": 1676, "[ebp + edx*CONST + CONST]": 1677, "[r8 + r13]": 1678, "[r12 + r8]": 1679, "[rdx + rcx*CONST + CONST]": 1680, "[rsi + rdi*CONST]": 1681, "pushal": 1682, "[r14 + r15]": 1683, "[edi + ebx*CONST]": 1684, "dword [r11 + rcx*CONST]": 1685, "word [ebx + edi*CONST]": 1686, "[esi + esi + CONST]": 1687, "word [edx + edi*CONST]": 1688, "[rsi + rbx*CONST]": 1689, "qword [r15 + rdi*CONST]": 1690, "dec dword [rip + CONST]": 1691, "[rbx + rcx]": 1692, "byte [r10 + r8 + CONST]": 1693, "dword [r11 + rdx + CONST]": 1694, "dword [r10 + rcx + CONST]": 1695, "byte [rbx + r15]": 1696, "stosb byte es:[di]": 1697, "maxss": 1698, "[rsi + rax + CONST]": 1699, "qword [rax + r15 + CONST]": 1700, "dword [rdi + rdx*CONST]": 1701, "[rax + r14]": 1702, "word [ebx + esi]": 1703, "[ecx + ecx + CONST]": 1704, "xmmword [r8 + rax*CONST]": 1705, "word ptr [si]": 1706, "[r8 + r10]": 1707, "[rdx + r13]": 1708, "[ecx + edx + CONST]": 1709, "word [rdi + rsi]": 1710, "[rcx + rdx + CONST]": 1711, "[rax + rbx + CONST]": 1712, "[esi + eax*CONST + CONST]": 1713, "xmmword [r13 + CONST]": 1714, "byte [r10 + rbx + CONST]": 1715, "[rcx + r14*CONST]": 1716, "inc dword [rip + CONST]": 1717, "[r13 + r14]": 1718, "[rcx + r13]": 1719, "dword [ecx + edi + CONST]": 1720, "byte [rdi + r14]": 1721, "[rsi + r15]": 1722, "byte [ebp + ecx + CONST]": 1723, "cmpxchg dword [rdx + CONST]": 1724, "dword [r9 + rax*CONST + CONST]": 1725, "byte [r8 + r9 + CONST]": 1726, "qword [rcx + r8 + CONST]": 1727, "scasw ax": 1728, "byte [rcx + r10 + CONST]": 1729, "xword [rdx]": 1730, "[r13 + rax]": 1731, "qword [r15 + rsi*CONST]": 1732, "word [ecx*CONST + CONST]": 1733, "qword [rdi + rcx*CONST]": 1734, "word [r8 + rdx]": 1735, "qword [r9 + rcx + CONST]": 1736, "[rcx + r9*CONST]": 1737, "word [rbx + rax*CONST + CONST]": 1738, "word [rcx + rbx*CONST]": 1739, "word [eax + eax]": 1740, "byte [r14 + rdi]": 1741, "[rsi + r15*CONST]": 1742, "[rcx + r15]": 1743, "word [edx + ecx]": 1744, "word [rcx + r8 + CONST]": 1745, "es:[bx]": 1746, "dword [ebx + eax + CONST]": 1747, "word [rcx + rdx + CONST]": 1748, "byte [ecx + esi]": 1749, "[r9 + r10]": 1750, "byte [rax + r12 + CONST]": 1751, "word es:[2]": 1752, "add dword [rcx]": 1753, "dword [edi + esi*CONST + CONST]": 1754, "qword [r12 + rsi*CONST + CONST]": 1755, "[r13 + r13*CONST]": 1756, "[rsi + r12*CONST]": 1757, "dword [rsi + rax*CONST]": 1758, "[r10 + r9*CONST]": 1759, "st(4)": 1760, "qword [r14 + r12 + CONST]": 1761, "[esi + edi + CONST]": 1762, "qword [rdi + r14 + CONST]": 1763, "qword [r10 + r15*CONST + CONST]": 1764, "qword [rbx + r14*CONST + CONST]": 1765, "word [edi + esi*CONST + CONST]": 1766, "qword [r12 + rcx]": 1767, "addpd": 1768, "qword [r15 + rdx + CONST]": 1769, "vpand": 1770, "word [edi + eax*CONST + CONST]": 1771, "qword [rdi + r14*CONST]": 1772, "qword [r14 + r15*CONST]": 1773, "[esi + edx*CONST]": 1774, "word [rdi + rax*CONST + CONST]": 1775, "[rbx + rdi + CONST]": 1776, "xadd qword [rax + CONST]": 1777, "word [rsp + rdi*CONST + CONST]": 1778, "byte [r9 + rcx + CONST]": 1779, "dword [r14 + rax*CONST]": 1780, "xmmword [rax + rdx]": 1781, "[rbx + r8]": 1782, "[rbx + r15]": 1783, "[r15 + rsi]": 1784, "qword [r11 + rsi*CONST]": 1785, "dword [edx + esi*CONST + CONST]": 1786, "qword [r9 + rcx]": 1787, "word [r8 + rcx*CONST]": 1788, "dword [rcx + rdi*CONST + CONST]": 1789, "dword [rax + rdi*CONST + CONST]": 1790, "word [rax + r14*CONST]": 1791, "qword [r10 + r9]": 1792, "xmmword [r10 + r9]": 1793, "dword [edi + esi]": 1794, "pandn": 1795, "word [rax + rbx + CONST]": 1796, "qword [edx]": 1797, "word [edi + eax*CONST]": 1798, "qword [r10 + rax*CONST + CONST]": 1799, "byte [rsi + rax*CONST + CONST]": 1800, "[r11 + r8]": 1801, "[r12 + r12 + CONST]": 1802, "dword [ecx + edi*CONST + CONST]": 1803, "add dword [rsi + CONST]": 1804, "dword [ebx + esi*CONST + CONST]": 1805, "byte [rdx + rsi]": 1806, "byte [rdx + r14 + CONST]": 1807, "byte [ecx + edi + CONST]": 1808, "[r8 + r11]": 1809, "[rbp + rax*CONST]": 1810, "[rsi + rdx*CONST]": 1811, "dword [r9 + r8 + CONST]": 1812, "dword [r8 + rdx]": 1813, "[r10 + rbx]": 1814, "[esi + ecx + CONST]": 1815, "word [rcx + r11 + CONST]": 1816, "dword [r9 + rax]": 1817, "byte [rsp + r15 + CONST]": 1818, "qword [rsi + r15*CONST]": 1819, "[rdi + r9]": 1820, "fabs": 1821, "word [rsi + rcx]": 1822, "[r15 + rdx]": 1823, "dec dword [edx + CONST]": 1824, "word [rax + rcx + CONST]": 1825, "qword [rbx + rdx]": 1826, "dword [rdx + r9*CONST]": 1827, "byte [rbp + rax]": 1828, "dword [r11 + rcx]": 1829, "setp": 1830, "byte [r12 + rax + CONST]": 1831, "movsw word es:[di]": 1832, "[r9 + rax]": 1833, "qword [rbx + rbp*CONST + CONST]": 1834, "word [esi + edx*CONST]": 1835, "word [rsp + rdx*CONST + CONST]": 1836, "[r14 + rbx*CONST]": 1837, "[rdi + rcx*CONST]": 1838, "word [rdi + rcx + CONST]": 1839, "dword [r8 + rax + CONST]": 1840, "byte [rdi + rbx + CONST]": 1841, "word [esi + ebx*CONST]": 1842, "[r10 + r8]": 1843, "[r10 + rdx*CONST]": 1844, "byte [rbx + rbp]": 1845, "cmpxchg qword [rdi]": 1846, "xmmword [rcx + r10 + CONST]": 1847, "dword [rax + r9 + CONST]": 1848, "qword [rcx + r13 + CONST]": 1849, "qword [rdx + rsi]": 1850, "xword [r11 + rdx]": 1851, "qword [rcx + rbp]": 1852, "word [6]": 1853, "[r9 + r8 + CONST]": 1854, "qword [rdi + rsi*CONST]": 1855, "qword [rdi + rbx*CONST + CONST]": 1856, "dec dword [rdi + CONST]": 1857, "word cs:[bx + CONST]": 1858, "byte [esi + edx + CONST]": 1859, "dword [edi + edx*CONST + CONST]": 1860, "word [ebx + eax*CONST]": 1861, "dword [rax + r15 + CONST]": 1862, "byte [r14 + rbp]": 1863, "qword [r15 + rax]": 1864, "[rbx + r13*CONST]": 1865, "word [r13 + rax*CONST]": 1866, "lfence": 1867, "qword [rbx + rbp + CONST]": 1868, "word [ebp + ebx*CONST + CONST]": 1869, "popfd": 1870, "byte [r8 + r11 + CONST]": 1871, "xmmword [rcx + r8 + CONST]": 1872, "dword [rbx + r10 + CONST]": 1873, "add dword [rax + CONST]": 1874, "byte [ebx + edx + CONST]": 1875, "setnp": 1876, "byte [rdi + rdx]": 1877, "andps": 1878, "cmpsb byte [si]": 1879, "byte ptr es:[di]": 1880, "byte [si + CONST]": 1881, "qword [r8 + rdx*CONST + CONST]": 1882, "qword [rcx + rbp + CONST]": 1883, "byte [edx + esi + CONST]": 1884, "[eax + esi*CONST + CONST]": 1885, "qword [rdx + rdi*CONST]": 1886, "fsubrp": 1887, "word [rdi + rcx]": 1888, "cmpxchg byte [ebx]": 1889, "cmpxchg byte [CONST]": 1890, "byte [r8 + rbx + CONST]": 1891, "[r10 + r8*CONST]": 1892, "add dword [rdx]": 1893, "qword [rbx + r9*CONST]": 1894, "dword [rdx + r12*CONST]": 1895, "qword [rdx + r15*CONST]": 1896, "byte [r15 + r9]": 1897, "qword [rsi + rcx*CONST + CONST]": 1898, "qword [rbx + rcx*CONST + CONST]": 1899, "byte [rax + rdi*CONST + CONST]": 1900, "qword [r14 + r12*CONST]": 1901, "[rbx + r12*CONST]": 1902, "qword [rsp + r13*CONST + CONST]": 1903, "word [rsi + r14*CONST]": 1904, "qword [r14 + rbx*CONST + CONST]": 1905, "byte [r11 + r10]": 1906, "byte [edi + esi*CONST + CONST]": 1907, "qword [rsp + rsi*CONST + CONST]": 1908, "qword [rdx + r12*CONST]": 1909, "qword [rdi + rdx + CONST]": 1910, "inc dword [edx + CONST]": 1911, "qword [r10 + rax*CONST]": 1912, "vpxor": 1913, "byte [rsi + rdx]": 1914, "byte [r13 + rax]": 1915, "byte [rcx + rsi]": 1916, "xmmword [rax + rcx + CONST]": 1917, "[rsi + r12]": 1918, "byte [rdx + r9 + CONST]": 1919, "word [rdx + rdi*CONST]": 1920, "dword [r12 + rax*CONST]": 1921, "qword [rbx + rcx*CONST]": 1922, "dword [rax + r14 + CONST]": 1923, "word [rdx + rcx*CONST + CONST]": 1924, "byte [rdx + r8 + CONST]": 1925, "vmovd": 1926, "xmmword [edx]": 1927, "dword [r8 + r9*CONST + CONST]": 1928, "qword [rdi + rdx*CONST + CONST]": 1929, "[rsi + r8]": 1930, "qword [ecx + edx]": 1931, "[r15 + r8]": 1932, "dword [r9 + rax*CONST]": 1933, "[eax + ecx*CONST + CONST]": 1934, "qword [rdi + rdx]": 1935, "byte [edx + edi]": 1936, "byte [rax + r9 + CONST]": 1937, "clc": 1938, "byte gs:[eax]": 1939, "[r9 + rbp]": 1940, "qword [rcx + r9]": 1941, "qword [eax*CONST + CONST]": 