{"push": 0, "mov": 1, "sub": 2, "lea": 3, "call": 4, "add": 5, "xor": 6, "cmp": 7, "jne": 8, "jmp": 9, "jbe": 10, "test": 11, "or": 12, "inc": 13, "pop": 14, "leave": 15, "ret": 16, "and": 17, "js": 18, "je": 19, "dec": 20, "jns": 21, "jl": 22, "jge": 23, "movzx": 24, "shr": 25, "int3": 26, "jb": 27, "neg": 28, "shl": 29, "rep": 30, "stosd": 31, "sar": 32, "setne": 33, "pxor": 34, "movdqa": 35, "jae": 36, "ja": 37, "sete": 38, "jle": 39, "sbb": 40, "jg": 41, "not": 42, "imul": 43, "pushfd": 44, "movsd": 45, "nop": 46, "ror": 47, "aaa": 48, "hlt": 49, "std": 50, "cld": 51, "div": 52, "adc": 53, "cdq": 54, "mul": 55, "idiv": 56, "movsx": 57, "setl": 58, "setge": 59, "stosb": 60, "stosw": 61, "movsw": 62, "movsb": 63, "seta": 64, "cmovb": 65, "cmova": 66, "arpl": 67, "cmove": 68, "jno": 69, "fstp": 70, "cmovne": 71, "ficom": 72, "int1": 73, "in": 74, "jp": 75, "xorps": 76, "movdqu": 77, "rol": 78, "xchg": 79, "movups": 80, "prefetchw": 81, "lock": 82, "cmpxchg": 83, "btr": 84, "fadd": 85, "les": 86, "jo": 87, "movaps": 88, "sti": 89, "out": 90, "wait": 91, "outsd": 92, "retf": 93, "outsb": 94, "jnp": 95, "int": 96, "cmovle": 97, "cmovns": 98, "cwde": 99, "lahf": 100, "insd": 101, "stc": 102, "daa": 103, "xadd": 104, "rcl": 105, "sahf": 106, "das": 107, "cmc": 108, "bts": 109, "bt": 110, "scasb": 111, "sal": 112, "clc": 113, "pushal": 114, "lds": 115, "cmovae": 116, "movlpd": 117, "cmovbe": 118, "bnd": 119, "fnclex": 120, "cpuid": 121, "xgetbv": 122, "popfd": 123, "rdtsc": 124, "fldz": 125, "fninit": 126, "clflush": 127, "rdrand": 128, "loop": 129, "rdseed": 130, "movd": 131, "paddq": 132, "pmuludq": 133, "psrlq": 134, "emms": 135, "movq": 136, "pand": 137, "insb": 138, "bswap": 139, "pshufd": 140, "pshufb": 141, "paddd": 142, "sha1msg1": 143, "sha1rnds4": 144, "sha1nexte": 145, "sha1msg2": 146, "psubd": 147, "punpcklqdq": 148, "psrldq": 149, "pslldq": 150, "psrld": 151, "por": 152, "pslld": 153, "vzeroall": 154, "vmovdqa": 155, "vmovdqu": 156, "vpshufb": 157, "vpaddd": 158, "shrd": 159, "vpalignr": 160, "shld": 161, "vpsrldq": 162, "vpxor": 163, "vpsrld": 164, "vpslldq": 165, "vpor": 166, "vpslld": 167, "fdivr": 168, "jecxz": 169, "popal": 170, "bound": 171, "sets": 172, "scasd": 173, "ucomisd": 174, "comisd": 175, "aam": 176, "fild": 177, "fld": 178, "cvtdq2pd": 179, "addsd": 180, "aad": 181, "cvttsd2si": 182, "salc": 183, "xlatb": 184, "cmovs": 185, "cmovg": 186, "cmovge": 187, "cvtpd2ps": 188, "divss": 189, "comiss": 190, "cmovl": 191, "cmpsd": 192, "seto": 193, "setb": 194, "setns": 195, "into": 196, "iretd": 197, "cli": 198, "andps": 199, "setg": 200, "syscall": 201, "movss": 202, "cvtps2pd": 203, "fldenv": 204, "mulsd": 205, "fnstsw": 206, "loopne": 207, "psllq": 208, "aas": 209, "lodsd": 210, "cmpsb": 211, "shufps": 212, "setle": 213, "rcr": 214, "pshuflw": 215, "movlhps": 216, "pcmpeqb": 217, "pmovmskb": 218, "bsf": 219, "palignr": 220, "bsr": 221, "pcmpistri": 222, "repne": 223, "lfence": 224, "pinsrw": 225, "pcmpeqw": 226, "lodsb": 227, "ficomp": 228, "vxorps": 229, "vpcmpeqb": 230, "vpmovmskb": 231, "vzeroupper": 232, "vpcmpeqw": 233, "cbw": 234, "fchs": 235, "fucomp": 236, "stmxcsr": 237, "fnstcw": 238, "fxch": 239, "fst": 240, "fyl2x": 241, "fld1": 242, "fucomip": 243, "fxam": 244, "faddp": 245, "fnsave": 246, "frstor": 247, "frndint": 248, "fcomp": 249, "fmul": 250, "fcompp": 251, "fucompp": 252, "fmulp": 253, "fucom": 254, "ldmxcsr": 255}
