{"push mov sub": 0, "mov sub push": 1, "sub push push": 2, "push push lea": 3, "push lea push": 4, "lea push call": 5, "push call lea": 6, "call lea push": 7, "lea push push": 8, "push push call": 9, "push call add": 10, "call add push": 11, "add push lea": 12, "push call xor": 13, "call xor push": 14, "xor push push": 15, "push push push": 16, "push call mov": 17, "call mov cmp": 18, "mov cmp jne": 19, "cmp jne push": 20, "jne push push": 21, "call xor jmp": 22, "xor jmp push": 23, "jmp push push": 24, "call mov mov": 25, "mov mov cmp": 26, "mov cmp jbe": 27, "cmp jbe mov": 28, "jbe mov push": 29, "mov push push": 30, "call mov push": 31, "mov push lea": 32, "push push mov": 33, "push mov push": 34, "push call test": 35, "call test jne": 36, "test jne push": 37, "push call push": 38, "call push call": 39, "call push push": 40, "xor jmp mov": 41, "jmp mov push": 42, "call mov add": 43, "mov add push": 44, "add push or": 45, "push or lea": 46, "or lea push": 47, "lea push lea": 48, "test jne mov": 49, "jne mov push": 50, "push mov call": 51, "mov call push": 52, "call push lea": 53, "call xor inc": 54, "xor inc pop": 55, "inc pop pop": 56, "pop pop pop": 57, "pop pop leave": 58, "pop leave ret": 59, "leave ret push": 60, "ret push mov": 61, "sub push lea": 62, "push call and": 63, "call and lea": 64, "and lea mov": 65, "lea mov add": 66, "mov add lea": 67, "add lea push": 68, "lea push mov": 69, "push mov mov": 70, "mov mov mov": 71, "mov mov call": 72, "mov call test": 73, "jne push pop": 74, "push pop leave": 75, "leave ret lea": 76, "ret lea push": 77, "push call pop": 78, "call pop leave": 79, "mov push mov": 80, "mov push call": 81, "push call cmp": 82, "call cmp pop": 83, "cmp pop jne": 84, "pop jne xor": 85, "jne xor mov": 86, "xor mov lea": 87, "mov lea test": 88, "lea test js": 89, "test js cmp": 90, "js cmp je": 91, "cmp je dec": 92, "je dec jns": 93, "dec jns lea": 94, "jns lea cmp": 95, "lea cmp jl": 96, "cmp jl xor": 97, "jl xor jmp": 98, "xor jmp lea": 99, "jmp lea jmp": 100, "lea jmp lea": 101, "jmp lea test": 102, "dec jns dec": 103, "jns dec js": 104, "dec js cmp": 105, "jns lea jmp": 106, "lea jmp add": 107, "jmp add cmp": 108, "add cmp jge": 109, "cmp jge lea": 110, "jge lea pop": 111, "lea pop pop": 112, "pop pop ret": 113, "pop ret push": 114, "call test je": 115, "test je mov": 116, "je mov mov": 117, "mov mov pop": 118, "mov pop pop": 119, "mov sub cmp": 120, "sub cmp jne": 121, "call push mov": 122, "mov call lea": 123, "call pop push": 124, "pop push push": 125, "call pop pop": 126, "pop pop push": 127, "push call leave": 128, "call leave ret": 129, "mov mov sub": 130, "mov sub sub": 131, "sub sub push": 132, "push push je": 133, "push je sub": 134, "je sub je": 135, "sub je dec": 136, "je dec je": 137, "dec je sub": 138, "je dec jne": 139, "dec jne mov": 140, "jne mov movzx": 141, "mov movzx shr": 142, "movzx shr push": 143, "shr push push": 144, "mov call cmp": 145, "call cmp jne": 146, "cmp jne mov": 147, "jne mov xor": 148, "mov xor push": 149, "xor push call": 150, "call push pop": 151, "push pop push": 152, "pop push lea": 153, "call add lea": 154, "mov call jmp": 155, "call jmp mov": 156, "jmp mov movzx": 157, "call cmp mov": 158, "cmp mov push": 159, "mov push jne": 160, "push jne call": 161, "jne call push": 162, "call push jmp": 163, "push jmp call": 164, "jmp call push": 165, "push call jmp": 166, "call jmp movzx": 167, "jmp movzx sub": 168, "movzx sub je": 169, "dec jne call": 170, "jne call cmp": 171, "call jmp test": 172, "jmp test jne": 173, "push jmp xor": 174, "jmp xor push": 175, "mov push xor": 176, "push xor push": 177, "call jmp push": 178, "jmp push call": 179, "call pop xor": 180, "pop xor pop": 181, "xor pop leave": 182, "call pop test": 183, "pop test je": 184, "test je push": 185, "je push call": 186, "call pop jmp": 187, "pop jmp call": 188, "jmp call cmp": 189, "call xor pop": 190, "xor pop pop": 191, "pop ret mov": 192, "ret mov push": 193, "mov cmp push": 194, "cmp push mov": 195, "push mov je": 196, "mov je add": 197, "je add cmp": 198, "add cmp jne": 199, "jne mov sub": 200, "mov sub movzx": 201, "sub movzx mov": 202, "movzx mov add": 203, "mov add test": 204, "add test jne": 205, "test jne pop": 206, "jne pop pop": 207, "jne mov pop": 208, "mov pop ret": 209, "pop ret int3": 210, "ret int3 mov": 211, "int3 mov mov": 212, "mov mov test": 213, "mov test je": 214, "test je xor": 215, "je xor mov": 216, "xor mov test": 217, "mov test jne": 218, "test jne cmp": 219, "jne cmp jb": 220, "cmp jb cmp": 221, "jb cmp je": 222, "cmp je jmp": 223, "je jmp push": 224, "jmp push mov": 225, "push mov cmp": 226, "mov cmp jb": 227, "cmp jb neg": 228, "jb neg and": 229, "neg and je": 230, "and je sub": 231, "je sub mov": 232, "sub mov add": 233, "mov add sub": 234, "add sub jne": 235, "sub jne mov": 236, "jne mov shl": 237, "mov shl add": 238, "shl add mov": 239, "add mov shl": 240, "add mov and": 241, "mov and shr": 242, "and shr je": 243, "shr je rep": 244, "je rep stosd": 245, "rep stosd test": 246, "stosd test je": 247, "je mov add": 248, "ret mov ret": 249, "mov ret mov": 250, "mov mov add": 251, "test jne sub": 252, "jne sub sar": 253, "sub sar dec": 254, "sar dec pop": 255, "dec pop ret": 256, "cmp jne call": 257, "ret push push": 258, "call xor cmp": 259, "xor cmp jne": 260, "mov cmp je": 261, "cmp je mov": 262, "je mov jmp": 263, "mov jmp mov": 264, "jmp mov cmp": 265, "jne mov cmp": 266, "cmp jne cmp": 267, "jne cmp jbe": 268, "cmp jbe xor": 269, "jbe xor cmp": 270, "xor cmp setne": 271, "cmp setne mov": 272, "setne mov call": 273, "jne push call": 274, "call pop call": 275, "pop call test": 276, "pop call mov": 277, "call mov call": 278, "call test jns": 279, "test jns push": 280, "jns push call": 281, "mov call mov": 282, "pop push call": 283, "call pop cmp": 284, "pop cmp je": 285, "cmp je push": 286, "test je movzx": 287, "je movzx jmp": 288, "movzx jmp push": 289, "jmp push pop": 290, "push call call": 291, "call call jmp": 292, "jmp mov mov": 293, "mov mov push": 294, "ret mov mov": 295, "call call mov": 296, "mov call ret": 297, "call ret call": 298, "ret call jmp": 299, "call jmp pxor": 300, "jmp pxor push": 301, "pxor push push": 302, "push mov and": 303, "mov and test": 304, "and test jne": 305, "jne mov and": 306, "shr je lea": 307, "je lea movdqa": 308, "lea movdqa movdqa": 309, "movdqa movdqa movdqa": 310, "movdqa movdqa lea": 311, "movdqa lea dec": 312, "lea dec jne": 313, "dec jne test": 314, "jne test je": 315, "je mov shr": 316, "mov shr je": 317, "shr je jmp": 318, "je jmp lea": 319, "jmp lea movdqa": 320, "lea movdqa lea": 321, "dec jne and": 322, "jne and je": 323, "and je mov": 324, "je mov xor": 325, "mov xor shr": 326, "xor shr je": 327, "shr je mov": 328, "je mov lea": 329, "mov lea dec": 330, "je mov inc": 331, "mov inc dec": 332, "inc dec jne": 333, "dec jne pop": 334, "ret mov neg": 335, "mov neg add": 336, "neg add sub": 337, "add sub xor": 338, "sub xor push": 339, "xor push mov": 340, "mov and je": 341, "dec jne shr": 342, "jne shr je": 343, "jne pop jmp": 344, "pop jmp push": 345, "call mov xor": 346, "mov xor ret": 347, "xor ret mov": 348, "jne cmp jne": 349, "cmp je cmp": 350, "je cmp je": 351, "je cmp jne": 352, "jne call xor": 353, "xor pop ret": 354, "ret push call": 355, "call xor ret": 356, "je push push": 357, "call pop ret": 358, "push call int3": 359, "call int3 push": 360, "int3 push call": 361, "call add pop": 362, "add pop ret": 363, "push mov xor": 364, "mov xor jmp": 365, "xor jmp test": 366, "jne mov test": 367, "test je call": 368, "je call add": 369, "call add cmp": 370, "add cmp jb": 371, "cmp jb pop": 372, "jb pop pop": 373, "pop call push": 374, "pop pop test": 375, "pop test jne": 376, "mov pop mov": 377, "pop mov cmp": 378, "mov cmp jae": 379, "cmp jae mov": 380, "jae mov test": 381, "jb cmp pop": 382, "cmp pop pop": 383, "pop pop je": 384, "pop je push": 385, "call pop and": 386, "pop and xor": 387, "and xor inc": 388, "xor inc cmp": 389, "inc cmp je": 390, "jne push mov": 391, "mov sub mov": 392, "sub mov cmp": 393, "cmp jb call": 394, "jb call cmp": 395, "call cmp je": 396, "je cmp jb": 397, "cmp jb push": 398, "jb push call": 399, "jne cmp je": 400, "mov mov jmp": 401, "jae mov mov": 402, "call add jmp": 403, "add jmp mov": 404, "jmp mov call": 405, "pop ret call": 406, "ret call ret": 407, "call ret mov": 408, "call add ret": 409, "add ret push": 410, "add ret mov": 411, "call int3 mov": 412, "int3 mov push": 413, "mov xor mov": 414, "xor mov cmp": 415, "cmp je inc": 416, "je inc cmp": 417, "inc cmp jb": 418, "cmp jb xor": 419, "jb xor pop": 420, "ret mov pop": 421, "sub mov xor": 422, "xor mov push": 423, "mov xor pop": 424, "xor pop mov": 425, "call add test": 426, "call mov test": 427, "add test je": 428, "je xor push": 429, "push call inc": 430, "call inc pop": 431, "inc pop cmp": 432, "pop cmp jbe": 433, "cmp jbe push": 434, "jbe push call": 435, "call lea mov": 436, "lea mov sub": 437, "sub push sar": 438, "push sar push": 439, "sar push sub": 440, "push sub push": 441, "add jmp push": 442, "push push jmp": 443, "push jmp push": 444, "cmp je xor": 445, "xor mov mov": 446, "jb push lea": 447, "mov call pop": 448, "call mov pop": 449, "pop pop xor": 450, "xor pop call": 451, "pop call leave": 452, "mov push cmp": 453, "push cmp je": 454, "cmp je add": 455, "je add lea": 456, "add lea cmp": 457, "lea cmp jb": 458, "cmp jb add": 459, "jb add cmp": 460, "add cmp jae": 461, "cmp jae cmp": 462, "jae cmp je": 463, "je xor test": 464, "xor test je": 465, "je mov test": 466, "test jne xor": 467, "jne xor jmp": 468, "xor jmp cmp": 469, "jmp cmp jne": 470, "cmp jne and": 471, "jne and xor": 472, "xor inc jmp": 473, "inc jmp cmp": 474, "jmp cmp je": 475, "je mov push": 476, "push pop mov": 477, "pop mov and": 478, "mov and add": 479, "and add cmp": 480, "add cmp jl": 481, "cmp jl mov": 482, "jl mov mov": 483, "jne mov jmp": 484, "mov jmp cmp": 485, "call pop mov": 486, "pop mov jmp": 487, "mov jmp and": 488, "jmp and push": 489, "and push call": 490, "pop mov pop": 491, "mov pop or": 492, "pop or pop": 493, "or pop pop": 494, "ret mov xor": 495, "mov xor test": 496, "xor test jne": 497, "mov movzx cmp": 498, "movzx cmp ja": 499, "cmp ja test": 500, "ja test je": 501, "test je test": 502, "je test je": 503, "test je cmp": 504, "cmp jne xor": 505, "jne xor test": 506, "xor test sete": 507, "test sete mov": 508, "sete mov add": 509, "mov add jmp": 510, "add jmp cmp": 511}