{"push mov": 0, "mov sub": 1, "sub push": 2, "push push": 3, "push lea": 4, "lea push": 5, "push call": 6, "call lea": 7, "call add": 8, "add push": 9, "call xor": 10, "xor push": 11, "call mov": 12, "mov cmp": 13, "cmp jne": 14, "jne push": 15, "xor jmp": 16, "jmp push": 17, "mov mov": 18, "cmp jbe": 19, "jbe mov": 20, "mov push": 21, "call test": 22, "test jne": 23, "call push": 24, "jmp mov": 25, "mov add": 26, "push or": 27, "or lea": 28, "jne mov": 29, "mov call": 30, "xor inc": 31, "inc pop": 32, "pop pop": 33, "pop leave": 34, "leave ret": 35, "ret push": 36, "call and": 37, "and lea": 38, "lea mov": 39, "add lea": 40, "push pop": 41, "ret lea": 42, "call pop": 43, "call cmp": 44, "cmp pop": 45, "pop jne": 46, "jne xor": 47, "xor mov": 48, "mov lea": 49, "lea test": 50, "test js": 51, "js cmp": 52, "cmp je": 53, "je dec": 54, "dec jns": 55, "jns lea": 56, "lea cmp": 57, "cmp jl": 58, "jl xor": 59, "jmp lea": 60, "lea jmp": 61, "jns dec": 62, "dec js": 63, "jmp add": 64, "add cmp": 65, "cmp jge": 66, "jge lea": 67, "lea pop": 68, "pop ret": 69, "test je": 70, "je mov": 71, "mov pop": 72, "sub cmp": 73, "pop push": 74, "call leave": 75, "sub sub": 76, "push je": 77, "je sub": 78, "sub je": 79, "dec je": 80, "dec jne": 81, "mov movzx": 82, "movzx shr": 83, "shr push": 84, "mov xor": 85, "call jmp": 86, "cmp mov": 87, "push jne": 88, "jne call": 89, "push jmp": 90, "jmp call": 91, "jmp movzx": 92, "movzx sub": 93, "jmp test": 94, "jmp xor": 95, "push xor": 96, "pop xor": 97, "xor pop": 98, "pop test": 99, "je push": 100, "pop jmp": 101, "ret mov": 102, "cmp push": 103, "mov je": 104, "je add": 105, "sub movzx": 106, "movzx mov": 107, "add test": 108, "jne pop": 109, "ret int3": 110, "int3 mov": 111, "mov test": 112, "je xor": 113, "jne cmp": 114, "cmp jb": 115, "jb cmp": 116, "je jmp": 117, "jb neg": 118, "neg and": 119, "and je": 120, "sub mov": 121, "add sub": 122, "sub jne": 123, "mov shl": 124, "shl add": 125, "add mov": 126, "mov and": 127, "and shr": 128, "shr je": 129, "je rep": 130, "rep stosd": 131, "stosd test": 132, "mov ret": 133, "jne sub": 134, "sub sar": 135, "sar dec": 136, "dec pop": 137, "xor cmp": 138, "mov jmp": 139, "jbe xor": 140, "cmp setne": 141, "setne mov": 142, "pop call": 143, "test jns": 144, "jns push": 145, "pop cmp": 146, "je movzx": 147, "movzx jmp": 148, "call call": 149, "call ret": 150, "ret call": 151, "jmp pxor": 152, "pxor push": 153, "and test": 154, "je lea": 155, "lea movdqa": 156, "movdqa movdqa": 157, "movdqa lea": 158, "lea dec": 159, "jne test": 160, "mov shr": 161, "jne and": 162, "xor shr": 163, "mov inc": 164, "inc dec": 165, "mov neg": 166, "neg add": 167, "sub xor": 168, "jne shr": 169, "xor ret": 170, "je cmp": 171, "call int3": 172, "int3 push": 173, "add pop": 174, "je call": 175, "jb pop": 176, "pop mov": 177, "cmp jae": 178, "jae mov": 179, "pop je": 180, "pop and": 181, "and xor": 182, "inc cmp": 183, "jb call": 184, "jb push": 185, "add jmp": 186, "add ret": 187, "je inc": 188, "jb xor": 189, "call inc": 190, "jbe push": 191, "push sar": 192, "sar push": 193, "push sub": 194, "push cmp": 195, "jb add": 196, "jae cmp": 197, "xor test": 198, "jmp cmp": 199, "inc jmp": 200, "and add": 201, "jl mov": 202, "jmp and": 203, "and push": 204, "pop or": 205, "or pop": 206, "movzx cmp": 207, "cmp ja": 208, "ja test": 209, "je test": 210, "test sete": 211, "sete mov": 212, "ja add": 213, "add movzx": 214, "movzx test": 215, "jne ret": 216, "jne or": 217, "or jmp": 218, "inc push": 219, "pop lea": 220, "lea movzx": 221, "push inc": 222, "lea je": 223, "jne add": 224, "and and": 225, "and mov": 226, "and or": 227, "sete push": 228, "push add": 229, "jmp inc": 230, "inc test": 231, "movzx add": 232, "jmp sub": 233, "sub jmp": 234, "inc xor": 235, "add inc": 236, "xor xor": 237, "cmp sete": 238, "shr jmp": 239, "jmp dec": 240, "dec test": 241, "jne movzx": 242, "inc add": 243, "inc mov": 244, "lea xor": 245, "jae lea": 246, "lea add": 247, "add add": 248, "mov dec": 249, "jmp or": 250, "ret cmp": 251, "sub lea": 252, "jae add": 253, "add or": 254, "or mov": 255, "jge mov": 256, "or and": 257, "jl jmp": 258, "test jle": 259, "jle mov": 260, "mov sar": 261, "sar shl": 262, "inc inc": 263, "je or": 264, "lea neg": 265, "neg sbb": 266, "sbb add": 267, "je and": 268, "or push": 269, "jl push": 270, "ret or": 271, "call or": 272, "ret xor": 273, "test setne": 274, "int3 int3": 275, "lea sub": 276, "push ret": 277, "add xor": 278, "xor call": 279, "lea lea": 280, "js jg": 281, "jg mov": 282, "je not": 283, "not mov": 284, "xor lea": 285, "mov or": 286, "or shl": 287, "shl or": 288, "mov not": 289, "and call": 290, "inc ret": 291, "jne lea": 292, "add call": 293, "ret and": 294, "and pop": 295, "pop add": 296, "jl pop": 297, "mov imul": 298, "imul add": 299, "jb imul": 300, "cmp jg": 301, "jg je": 302, "pop sub": 303, "imul mov": 304, "mov pushfd": 305, "pushfd pop": 306, "je pop": 307, "int3 xor": 308, "jb lea": 309, "ja push": 310, "ret add": 311, "cmp sbb": 312, "sbb and": 313, "jb mov": 314, "je sar": 315, "lea call": 316, "call neg": 317, "sbb neg": 318, "neg pop": 319, "pop dec": 320, "movzx push": 321, "push movzx": 322, "movzx xor": 323, "jb inc": 324, "shr not": 325, "not and": 326, "xor add": 327, "sub ret": 328, "and cmp": 329, "mov jne": 330, "push test": 331, "add dec": 332, "ret test": 333, "jne jmp": 334, "cmp jle": 335, "jle cmp": 336, "ret jmp": 337, "jbe or": 338, "jbe cmp": 339, "push and": 340, "shr and": 341, "jb rep": 342, "rep movsd": 343, "movsd jmp": 344, "sub jb": 345, "jb and": 346, "jmp jmp": 347, "jmp nop": 348, "nop jmp": 349, "nop cmp": 350, "cmp nop": 351, "add ror": 352, "ror inc": 353, "lea and": 354, "shr mov": 355, "nop and": 356, "add shr": 357, "shr add": 358, "lea aaa": 359, "aaa cmp": 360, "cmp add": 361, "cmp hlt": 362, "hlt cmp": 363, "add leave": 364, "ret nop": 365, "nop mov": 366, "nop lea": 367, "jb std": 368, "std rep": 369, "movsd cld": 370, "cld jmp": 371, "neg jmp": 372, "and sub": 373, "pop setne": 374, "setne ret": 375, "test jmp": 376, "and inc": 377, "call sub": 378, "mov leave": 379, "or cmp": 380, "mov jbe": 381, "ja mov": 382, "test jge": 383, "jge push": 384, "lea inc": 385, "cmp lea": 386, "lea jne": 387, "or movzx": 388, "movzx dec": 389, "test mov": 390, "mov jge": 391, "sete test": 392, "xor or": 393, "dec mov": 394, "push jbe": 395, "or ret": 396, "neg lea": 397, "lea sbb": 398, "mov jb": 399, "pop div": 400, "div push": 401, "xor div": 402, "div inc": 403, "jae pop": 404, "mov ja": 405, "ja jb": 406, "ja cmp": 407, "ja jae": 408, "shr cmp": 409, "or je": 410, "lea jb": 411, "jns pop": 412, "test jg": 413, "jg jl": 414, "jl test": 415, "test jae": 416, "inc neg": 417, "neg adc": 418, "adc neg": 419, "neg push": 420, "sub or": 421, "test jbe": 422, "jb jmp": 423, "jne inc": 424, "jne dec": 425, "dec push": 426, "test pop": 427, "setne xor": 428, "sbb pop": 429, "pop inc": 430, "push cdq": 431, "cdq mov": 432, "sub pop": 433, "pop sar": 434, "sar ret": 435, "jmp ret": 436, "jbe movzx": 437, "jl cmp": 438, "jg add": 439, "inc movzx": 440, "movzx inc": 441, "lea jbe": 442, "jb ja": 443, "shr lea": 444, "and dec": 445, "pop jbe": 446, "jbe add": 447, "add and": 448, "jbe lea": 449, "jae inc": 450, "sub inc": 451, "test lea": 452, "jbe sub": 453, "call movzx": 454, "inc je": 455, "jae push": 456, "inc lea": 457, "sar pop": 458, "dec dec": 459, "dec jmp": 460, "sar jmp": 461, "sar mov": 462, "je imul": 463, "test jl": 464, "jl add": 465, "add js": 466, "js mov": 467, "sub test": 468, "sub and": 469, "and jmp": 470, "sbb lea": 471, "lea not": 472, "mov setne": 473, "ja movzx": 474, "movzx lea": 475, "shl sub": 476, "test push": 477, "xor sub": 478, "pop sbb": 479, "sbb cmp": 480, "add adc": 481, "adc inc": 482, "xor movzx": 483, "xor and": 484, "or jne": 485, "or or": 486, "jne shl": 487, "or inc": 488, "pop movzx": 489, "jae movzx": 490, "sub shl": 491, "or dec": 492, "jae jmp": 493, "inc shl": 494, "shr sub": 495, "sar cmp": 496, "sub add": 497, "add shl": 498, "sete jmp": 499, "sub js": 500, "js xor": 501, "mov jg": 502, "jg xor": 503, "shl mov": 504, "mov jle": 505, "jle xor": 506, "jb or": 507, "dec cmp": 508, "ja inc": 509, "mov jae": 510, "jl lea": 511, "shl push": 512, "je shl": 513, "not not": 514, "jl inc": 515, "lea setne": 516, "setne push": 517, "push setne": 518, "setne call": 519, "setne jmp": 520, "jl je": 521, "or call": 522, "shr test": 523, "neg ret": 524, "shl call": 525, "xor shl": 526, "inc jne": 527, "sbb inc": 528, "inc call": 529, "sbb push": 530, "pop sete": 531, "sete pop": 532, "lea adc": 533, "adc and": 534, "sub neg": 535, "ja lea": 536, "adc mov": 537, "mov adc": 538, "adc cmp": 539, "adc push": 540, "setne cmp": 541, "push mul": 542, "mul push": 543, "push neg": 544, "setne leave": 545, "setne inc": 546, "add neg": 547, "jb movzx": 548, "movzx movzx": 549, "movzx and": 550, "jb test": 551, "ja sub": 552, "shr call": 553, "lea shr": 554, "ret sub": 555, "jmp pop": 556, "and ret": 557, "jge xor": 558, "jl sub": 559, "mov mul": 560, "mul cmp": 561, "mov sbb": 562, "xor leave": 563, "jbe pop": 564, "sbb mov": 565, "ret movzx": 566, "jg cmp": 567, "jge cmp": 568, "jle push": 569, "mov div": 570, "div xor": 571, "inc div": 572, "div mov": 573, "div add": 574, "movzx cdq": 575, "cdq idiv": 576, "idiv mov": 577, "idiv movzx": 578, "mov cdq": 579, "idiv add": 580, "jle movzx": 581, "mov jl": 582, "jl movzx": 583, "idiv xor": 584, "push adc": 585, "dec div": 586, "div test": 587, "sete dec": 588, "dec and": 589, "jmp movsx": 590, "movsx mov": 591, "cdq push": 592, "lea cdq": 593, "movzx call": 594, "pop shl": 595, "shl test": 596, "call not": 597, "push shr": 598, "movzx shl": 599, "jl jg": 600, "adc xor": 601, "sub sbb": 602, "jae and": 603, "adc jne": 604, "or xor": 605, "or test": 606, "pop adc": 607, "adc pop": 608, "cdq add": 609, "sbb xor": 610, "adc jmp": 611, "jae sub": 612, "adc test": 613, "adc add": 614, "jmp jle": 615, "jle and": 616, "ret jle": 617, "xor neg": 618, "mov sete": 619, "sete xor": 620, "inc or": 621, "jbe test": 622, "sub call": 623, "adc sub": 624, "ja jmp": 625, "push sbb": 626, "sbb test": 627, "xor imul": 628, "div cmp": 629, "sub shr": 630, "call dec": 631, "jbe jmp": 632, "test ja": 633, "ja xor": 634, "push dec": 635, "setne add": 636, "shl xor": 637, "dec sub": 638, "jge or": 639, "sar leave": 640, "sar je": 641, "pop ja": 642, "jae shl": 643, "pop jb": 644, "je jbe": 645, "jbe inc": 646, "pop jae": 647, "pop jge": 648, "adc lea": 649, "adc ret": 650, "inc and": 651, "mul mov": 652, "setne pop": 653, "jmp ja": 654, "je jl": 655, "push jae": 656, "sub cdq": 657, "push jb": 658, "dec shr": 659, "not cmp": 660, "shl cmp": 661, "pop neg": 662, "push setl": 663, "setl dec": 664, "push not": 665, "cdq shr": 666, "ja and": 667, "sete cmp": 668, "dec inc": 669, "cmp jmp": 670, "xor dec": 671, "dec lea": 672, "or add": 673, "adc call": 674, "ja je": 675, "lea ja": 676, "mov rep": 677, "movsd je": 678, "lea shl": 679, "or shr": 680, "shr inc": 681, "jbe shr": 682, "sbb call": 683, "pop rep": 684, "movsd mov": 685, "ret neg": 686, "ja jne": 687, "test setge": 688, "setge ret": 689, "shr rep": 690, "stosd mov": 691, "and rep": 692, "rep stosb": 693, "stosb pop": 694, "push shl": 695, "setne or": 696, "jbe and": 697, "sbb not": 698, "and neg": 699, "lea or": 700, "jg lea": 701, "mov stosd": 702, "stosd stosd": 703, "stosd xor": 704, "stosd stosw": 705, "stosw stosb": 706, "stosb xor": 707, "stosb mov": 708, "jbe call": 709, "lea rep": 710, "movsd lea": 711, "add je": 712, "movsd pop": 713, "setne test": 714, "jae or": 715, "lea movsd": 716, "movsd movsd": 717, "mov movsd": 718, "movsd call": 719, "add movsd": 720, "movsd inc": 721, "mov movsw": 722, "movsw movsb": 723, "movsb mov": 724, "cmp seta": 725, "seta or": 726, "and leave": 727, "sete lea": 728, "jb jne": 729, "push sete": 730, "sete call": 731, "neg mov": 732, "je jge": 733, "dec movsd": 734, "movsd push": 735, "sub movsd": 736, "ja pop": 737, "shl lea": 738, "shl movsd": 739, "jb jbe": 740, "shl jmp": 741, "ret shl": 742, "push imul": 743, "imul shr": 744, "and imul": 745, "shl dec": 746, "ret ret": 747, "not jne": 748, "je shr": 749, "shr or": 750, "shr xor": 751, "pop not": 752, "not pop": 753, "ret shr": 754, "lea stosd": 755, "stosd lea": 756, "sete add": 757, "movsd xor": 758, "jb shr": 759, "jbe dec": 760, "jg push": 761, "shl ret": 762, "setne dec": 763, "seta mov": 764, "imul push": 765, "imul and": 766, "imul cmp": 767, "add imul": 768, "imul shl": 769, "shl and": 770, "cmp setge": 771, "setge inc": 772, "setge mov": 773, "lea imul": 774, "lea ret": 775, "ret dec": 776, "inc shr": 777, "shr shl": 778, "sub dec": 779, "shr pop": 780, "adc or": 781, "neg test": 782, "sbb jmp": 783, "jg sub": 784, "add rep": 785, "stosb push": 786, "mov seta": 787, "seta and": 788, "jae xor": 789, "shl shl": 790, "jg or": 791, "jge inc": 792, "shr dec": 793, "and movzx": 794, "jb sub": 795, "shl inc": 796, "cmp movzx": 797, "dec neg": 798, "movsd cmp": 799, "jae call": 800, "sbb or": 801, "sete ret": 802, "sbb sub": 803, "jge test": 804, "and shl": 805, "lea jge": 806, "call jle": 807, "mov js": 808, "setge push": 809, "push rep": 810, "xor rep": 811, "stosd push": 812, "je neg": 813, "jle lea": 814, "jge and": 815, "cmp dec": 816, "mov cmovb": 817, "cmovb dec": 818, "test dec": 819, "dec add": 820, "int3 dec": 821, "cmp inc": 822, "dec cmova": 823, "cmova dec": 824, "jae dec": 825, "jb dec": 826, "inc mul": 827, "mul shr": 828, "inc sub": 829, "dec arpl": 830, "arpl inc": 831, "add jne": 832, "ja call": 833, "mov int3": 834, "int3 inc": 835, "dec mul": 836, "mul dec": 837, "shr jne": 838, "arpl mov": 839, "movzx cmovb": 840, "cmovb inc": 841, "jns ret": 842, "dec movzx": 843, "mov ror": 844, "ror sbb": 845, "sbb int3": 846, "jns mov": 847, "jmp int3": 848, "int3 jmp": 849, "je jae": 850, "jns xor": 851, "call nop": 852, "nop dec": 853, "inc cmove": 854, "cmove mov": 855, "arpl test": 856, "arpl xor": 857, "inc sete": 858, "arpl dec": 859, "dec shl": 860, "ja dec": 861, "jge dec": 862, "sete inc": 863, "int3 sub": 864, "cmp cmova": 865, "cmova lea": 866, "dec xor": 867, "dec or": 868, "ret jno": 869, "jno fstp": 870, "fstp push": 871, "cmp and": 872, "mov cmovne": 873, "cmovne inc": 874, "cmp xor": 875, "int3 jno": 876, "jno ficom": 877, "ficom int1": 878, "int1 test": 879, "test in": 880, "in sub": 881, "sub ror": 882, "ror jp": 883, "jp push": 884, "add sar": 885, "sar adc": 886, "adc xorps": 887, "xorps dec": 888, "lea xorps": 889, "xorps inc": 890, "xor movdqu": 891, "movdqu movdqu": 892, "movdqu call": 893, "xorps mov": 894, "mov xorps": 895, "xorps movdqu": 896, "movdqu dec": 897, "test or": 898, "test add": 899, "test rol": 900, "rol ret": 901, "sub leave": 902, "leave dec": 903, "push movsb": 904, "movsb xchg": 905, "xchg dec": 906, "leave mov": 907, "xor xorps": 908, "mov movups": 909, "movups dec": 910, "je jle": 911, "jle inc": 912, "or prefetchw": 913, "prefetchw mov": 914, "or lock": 915, "lock cmpxchg": 916, "cmpxchg jne": 917, "and not": 918, "and jbe": 919, "cmove and": 920, "mov btr": 921, "btr inc": 922, "xor lock": 923, "cmpxchg je": 924, "neg inc": 925, "inc sbb": 926, "inc not": 927, "not inc": 928, "jmp not": 929, "xor movups": 930, "movups movups": 931, "movups movsd": 932, "movsd dec": 933, "in fadd": 934, "fadd add": 935, "test les": 936, "les pop": 937, "or jo": 938, "jo dec": 939, "sub movaps": 940, "movaps movaps": 941, "movaps dec": 942, "nop movups": 943, "js movdqu": 944, "dec call": 945, "test sti": 946, "sti jno": 947, "jno add": 948, "add int3": 949, "or int3": 950, "ja or": 951, "test imul": 952, "imul int3": 953, "pop jno": 954, "test out": 955, "out or": 956, "test wait": 957, "wait jo": 958, "jo add": 959, "pop jo": 960, "test cmp": 961, "test sub": 962, "sti outsd": 963, "outsd or": 964, "test xchg": 965, "xchg add": 966, "test retf": 967, "retf outsb": 968, "outsb or": 969, "test inc": 970, "inc outsb": 971, "test jnp": 972, "jnp or": 973, "dec outsb": 974, "movups movdqu": 975, "movdqu je": 976, "mov int": 977, "int dec": 978, "movzx or": 979, "test cmovle": 980, "cmovle jmp": 981, "ror add": 982, "nop xorps": 983, "les in": 984, "in dec": 985, "movdqu movups": 986, "test cmovns": 987, "cmovns mov": 988, "sub adc": 989, "adc dec": 990, "neg dec": 991, "dec sbb": 992, "sbb dec": 993, "dec cmovne": 994, "cmovne dec": 995, "js dec": 996, "dec cwde": 997, "cwde dec": 998, "lea movups": 999, "movups call": 1000, "jno push": 1001, "push stosd": 1002, "stosd lahf": 1003, "lahf insd": 1004, "insd in": 1005, "in cmp": 1006, "cmovne ret": 1007, "jno pop": 1008, "dec sar": 1009, "mov out": 1010, "out nop": 1011, "nop stc": 1012, "stc dec": 1013, "dec cmove": 1014, "cmove jmp": 1015, "mov daa": 1016, "daa xchg": 1017, "xchg inc": 1018, "ret xchg": 1019, "xchg in": 1020, "lock xadd": 1021, "xadd cmp": 1022, "mov lock": 1023, "lock inc": 1024, "xadd inc": 1025, "xor rcl": 1026, "rcl add": 1027, "nop test": 1028, "cmovne mov": 1029, "fstp daa": 1030, "daa sub": 1031, "test and": 1032, "and int3": 1033, "fstp sahf": 1034, "sahf pushfd": 1035, "pushfd stosd": 1036, "stosd dec": 1037, "dec das": 1038, "das xchg": 1039, "xchg cmc": 1040, "cmc call": 1041, "jmp bts": 1042, "bts mov": 1043, "je bt": 1044, "bt jae": 1045, "jae btr": 1046, "btr jmp": 1047, "test cmove": 1048, "cmovle mov": 1049, "cmovle dec": 1050, "sub movups": 1051, "movups inc": 1052, "movups mov": 1053, "inc movups": 1054, "xadd add": 1055, "sub xorps": 1056, "in push": 1057, "mov scasb": 1058, "scasb aaa": 1059, "sub sal": 1060, "sal leave": 1061, "leave call": 1062, "jno sar": 1063, "mov in": 1064, "in clc": 1065, "clc add": 1066, "ror dec": 1067, "xorps movups": 1068, "mov les": 1069, "les and": 1070, "and sbb": 1071, "dec pushfd": 1072, "pushfd dec": 1073, "nop xor": 1074, "cmp cmovne": 1075, "lea lock": 1076, "or sbb": 1077, "mov retf": 1078, "retf call": 1079, "rep movsb": 1080, "movsb dec": 1081, "ret inc": 1082, "stosb dec": 1083, "int xorps": 1084, "lea movdqu": 1085, "pop jle": 1086, "pop jp": 1087, "jp pushal": 1088, "pushal lds": 1089, "lds in": 1090, "in js": 1091, "nop inc": 1092, "inc daa": 1093, "daa add": 1094, "push cmovae": 1095, "cmovae jmp": 1096, "cmovae push": 1097, "cmp cmovae": 1098, "lea cmovae": 1099, "cmovae mov": 1100, "xorps push": 1101, "push movlpd": 1102, "movlpd call": 1103, "pop jl": 1104, "mov cmovae": 1105, "cmovae and": 1106, "cmova or": 1107, "lea cmova": 1108, "cmova call": 1109, "jns neg": 1110, "div sub": 1111, "xadd mov": 1112, "cmp cmovb": 1113, "cmovb lea": 1114, "int3 cmp": 1115, "cmp cmovbe": 1116, "cmovbe push": 1117, "cmovb mov": 1118, "inc lock": 1119, "xadd xor": 1120, "call imul": 1121, "jns call": 1122, "cmp bnd": 1123, "bnd jne": 1124, "jne bnd": 1125, "bnd ret": 1126, "ret bnd": 1127, "bnd jmp": 1128, "ror xor": 1129, "movzx imul": 1130, "cmpxchg test": 1131, "or ror": 1132, "mov xchg": 1133, "xchg pop": 1134, "push ror": 1135, "ror cmp": 1136, "je fnclex": 1137, "fnclex call": 1138, "int3 call": 1139, "pop int": 1140, "int mov": 1141, "pop imul": 1142, "int push": 1143, "movzx leave": 1144, "int3 and": 1145, "push cpuid": 1146, "cpuid mov": 1147, "xor xgetbv": 1148, "xgetbv mov": 1149, "mov bnd": 1150, "push bnd": 1151, "xor bnd": 1152, "bnd call": 1153, "call bnd": 1154, "xor pushfd": 1155, "push popfd": 1156, "popfd pushfd": 1157, "mov bt": 1158, "jae cpuid": 1159, "mov cpuid": 1160, "cpuid cmp": 1161, "cpuid or": 1162, "cpuid movzx": 1163, "xor cpuid": 1164, "cpuid bt": 1165, "jae shr": 1166, "cpuid and": 1167, "or bt": 1168, "xgetbv and": 1169, "nop nop": 1170, "lea bt": 1171, "jae rdtsc": 1172, "rdtsc ret": 1173, "push nop": 1174, "nop pop": 1175, "pop nop": 1176, "and jne": 1177, "jne pushfd": 1178, "pop bt": 1179, "rdtsc push": 1180, "push hlt": 1181, "hlt rdtsc": 1182, "rdtsc sub": 1183, "ret pushfd": 1184, "mov nop": 1185, "je nop": 1186, "jne pxor": 1187, "pxor pxor": 1188, "pxor fldz": 1189, "fldz fldz": 1190, "fldz wait": 1191, "wait fninit": 1192, "fninit nop": 1193, "lea nop": 1194, "nop lock": 1195, "nop push": 1196, "jne neg": 1197, "neg shr": 1198, "jae bt": 1199, "mov rdtsc": 1200, "rdtsc mov": 1201, "mov clflush": 1202, "clflush lock": 1203, "lock add": 1204, "nop rdtsc": 1205, "add rdtsc": 1206, "nop clflush": 1207, "je rdtsc": 1208, "setne sub": 1209, "mov rdrand": 1210, "rdrand jb": 1211, "jb loop": 1212, "loop jmp": 1213, "mov rdseed": 1214, "rdseed jb": 1215, "int3 lea": 1216, "mov movd": 1217, "movd pxor": 1218, "pxor jmp": 1219, "nop movd": 1220, "movd paddq": 1221, "paddq movd": 1222, "movd pmuludq": 1223, "pmuludq movd": 1224, "pmuludq paddq": 1225, "movd movd": 1226, "pmuludq psrlq": 1227, "psrlq movd": 1228, "movd psrlq": 1229, "movd add": 1230, "add pmuludq": 1231, "psrlq paddq": 1232, "movd lea": 1233, "lea psrlq": 1234, "psrlq sub": 1235, "jne movd": 1236, "pmuludq lea": 1237, "lea paddq": 1238, "paddq paddq": 1239, "movd sub": 1240, "sub psrlq": 1241, "psrlq lea": 1242, "movd emms": 1243, "emms ret": 1244, "mul add": 1245, "pxor nop": 1246, "lea movq": 1247, "movq sub": 1248, "jne emms": 1249, "div ret": 1250, "movd mov": 1251, "xor movd": 1252, "pmuludq movq": 1253, "movq movq": 1254, "movq pand": 1255, "pand pmuludq": 1256, "pmuludq pmuludq": 1257, "psrlq psrlq": 1258, "psrlq inc": 1259, "inc nop": 1260, "nop pmuludq": 1261, "paddq movq": 1262, "pand movd": 1263, "jl pmuludq": 1264, "pand paddq": 1265, "movq inc": 1266, "paddq inc": 1267, "dec pmuludq": 1268, "movq movd": 1269, "movd pand": 1270, "paddq dec": 1271, "mov pmuludq": 1272, "movq lea": 1273, "jle emms": 1274, "emms jmp": 1275, "xor nop": 1276, "adc imul": 1277, "imul xor": 1278, "and nop": 1279, "adc shr": 1280, "nop sbb": 1281, "jge sbb": 1282, "dec jge": 1283, "dec outsd": 1284, "outsd outsb": 1285, "outsb je": 1286, "je outsd": 1287, "outsd insd": 1288, "insd jb": 1289, "and insb": 1290, "insb je": 1291, "je jo": 1292, "jo imul": 1293, "and jb": 1294, "jb js": 1295, "js sub": 1296, "and jo": 1297, "jo jb": 1298, "inc outsd": 1299, "outsd jo": 1300, "jo outsb": 1301, "outsb jae": 1302, "jae insb": 1303, "insb outsd": 1304, "outsd jb": 1305, "add rol": 1306, "rol mov": 1307, "mov rol": 1308, "rol add": 1309, "rol xor": 1310, "mov bswap": 1311, "bswap bswap": 1312, "bswap mov": 1313, "and ror": 1314, "xor rol": 1315, "ror mov": 1316, "rol lea": 1317, "sub movdqu": 1318, "movdqu movd": 1319, "movd and": 1320, "and movdqa": 1321, "movdqa movdqu": 1322, "movdqu pshufd": 1323, "pshufd movdqu": 1324, "movdqu pshufb": 1325, "pshufb movdqu": 1326, "pshufb pshufb": 1327, "pshufb jmp": 1328, "movdqa paddd": 1329, "paddd cmovne": 1330, "cmovne movdqa": 1331, "movdqa sha1msg1": 1332, "sha1msg1 movdqa": 1333, "movdqa sha1rnds4": 1334, "sha1rnds4 sha1nexte": 1335, "sha1nexte pxor": 1336, "pxor sha1msg1": 1337, "sha1msg1 sha1msg2": 1338, "sha1msg2 movdqa": 1339, "pxor sha1msg2": 1340, "sha1msg2 sha1msg1": 1341, "sha1msg2 movdqu": 1342, "movdqu movdqa": 1343, "sha1nexte movdqu": 1344, "pshufb movdqa": 1345, "sha1rnds4 movdqa": 1346, "movdqa pshufb": 1347, "pshufb sha1nexte": 1348, "sha1nexte paddd": 1349, "paddd jne": 1350, "jne pshufd": 1351, "pshufd pshufd": 1352, "movdqa mov": 1353, "movdqa shl": 1354, "shl movdqa": 1355, "movdqa add": 1356, "add movdqa": 1357, "mov movdqu": 1358, "pshufb paddd": 1359, "paddd paddd": 1360, "paddd movdqa": 1361, "movdqa psubd": 1362, "psubd movdqa": 1363, "mov psubd": 1364, "psubd xor": 1365, "xor pshufd": 1366, "pshufd and": 1367, "nop ror": 1368, "mov punpcklqdq": 1369, "punpcklqdq movdqa": 1370, "xor paddd": 1371, "movdqa rol": 1372, "add psrldq": 1373, "psrldq and": 1374, "xor pxor": 1375, "pxor add": 1376, "ror pxor": 1377, "pxor xor": 1378, "add pxor": 1379, "rol movdqa": 1380, "movdqa xor": 1381, "ror movdqa": 1382, "xor pslldq": 1383, "pslldq paddd": 1384, "paddd mov": 1385, "add psrld": 1386, "psrld xor": 1387, "xor psrld": 1388, "psrld add": 1389, "ror por": 1390, "por xor": 1391, "add pslld": 1392, "pslld xor": 1393, "rol pxor": 1394, "pxor movdqa": 1395, "and pxor": 1396, "pxor pshufd": 1397, "pshufd xor": 1398, "xor movdqa": 1399, "pxor punpcklqdq": 1400, "punpcklqdq xor": 1401, "add paddd": 1402, "paddd and": 1403, "rol pslld": 1404, "pslld add": 1405, "and psrld": 1406, "rol por": 1407, "por add": 1408, "mov pshufd": 1409, "pshufd rol": 1410, "xor ror": 1411, "movdqa ror": 1412, "ror paddd": 1413, "paddd add": 1414, "psrld mov": 1415, "add por": 1416, "ror pshufd": 1417, "pshufd add": 1418, "rol pshufd": 1419, "punpcklqdq and": 1420, "paddd xor": 1421, "por mov": 1422, "add pshufd": 1423, "mov movdqa": 1424, "je movdqa": 1425, "movdqu add": 1426, "add pshufb": 1427, "pshufb mov": 1428, "ror pshufb": 1429, "pshufb add": 1430, "mov paddd": 1431, "paddd rol": 1432, "psubd rol": 1433, "nop add": 1434, "lea vzeroall": 1435, "vzeroall vmovdqa": 1436, "vmovdqa vmovdqa": 1437, "vmovdqa mov": 1438, "and vmovdqa": 1439, "vmovdqa shl": 1440, "shl vmovdqa": 1441, "vmovdqa add": 1442, "add vmovdqa": 1443, "mov vmovdqu": 1444, "vmovdqu vmovdqu": 1445, "vmovdqu vpshufb": 1446, "vpshufb vpshufb": 1447, "vpshufb vmovdqa": 1448, "vmovdqa vpshufb": 1449, "vpshufb vpaddd": 1450, "vpaddd vpaddd": 1451, "vpaddd vmovdqa": 1452, "mov vmovdqa": 1453, "vmovdqa xor": 1454, "xor vmovdqa": 1455, "vmovdqa and": 1456, "nop shrd": 1457, "shrd xor": 1458, "xor vpalignr": 1459, "vpalignr mov": 1460, "add vpaddd": 1461, "xor shld": 1462, "shld vpsrldq": 1463, "vpsrldq add": 1464, "and vpxor": 1465, "vpxor xor": 1466, "add vpxor": 1467, "vpxor shrd": 1468, "shld add": 1469, "and vpsrld": 1470, "vpsrld xor": 1471, "add shrd": 1472, "xor vpslldq": 1473, "vpslldq vpaddd": 1474, "vpaddd mov": 1475, "shld vpsrld": 1476, "vpsrld vpor": 1477, "vpor add": 1478, "add vpslld": 1479, "vpslld shrd": 1480, "xor vpxor": 1481, "vpxor mov": 1482, "shld vpxor": 1483, "vpxor add": 1484, "vpslld vmovdqa": 1485, "vmovdqa shrd": 1486, "add vpalignr": 1487, "vpalignr vpxor": 1488, "vpxor vmovdqa": 1489, "shld vmovdqa": 1490, "vmovdqa vpaddd": 1491, "vpaddd add": 1492, "xor vpsrld": 1493, "vpsrld vmovdqa": 1494, "shld vpslld": 1495, "vpslld add": 1496, "add vpor": 1497, "vpor xor": 1498, "mov shld": 1499, "xor shrd": 1500, "shrd add": 1501, "vpaddd shrd": 1502, "shrd mov": 1503, "shrd vpxor": 1504, "vpaddd shld": 1505, "add vpsrld": 1506, "mov vpslld": 1507, "vpslld xor": 1508, "and vpor": 1509, "shrd vmovdqa": 1510, "vpaddd xor": 1511, "je vmovdqa": 1512, "vmovdqa vmovdqu": 1513, "vmovdqu add": 1514, "add vpshufb": 1515, "vpshufb mov": 1516, "xor vpshufb": 1517, "shld vpaddd": 1518, "add vzeroall": 1519, "vzeroall mov": 1520, "nop cdq": 1521, "cdq jns": 1522, "pop cdq": 1523, "jmp outsb": 1524, "outsb mov": 1525, "outsb fdivr": 1526, "ja shl": 1527, "int3 ret": 1528, "stosd pop": 1529, "push movq": 1530, "movq mov": 1531, "mov movsx": 1532, "movsx push": 1533, "shr shr": 1534, "cmovb cmp": 1535, "test cmovne": 1536, "sar lea": 1537, "sar sub": 1538, "mov movq": 1539, "movq cmp": 1540, "cmovb or": 1541, "or sub": 1542, "jmp shr": 1543, "xorps movsd": 1544, "jmp movsd": 1545, "mul xor": 1546, "lea movsx": 1547, "movsx lea": 1548, "inc movsx": 1549, "movsx add": 1550, "call jecxz": 1551, "jecxz inc": 1552, "add popal": 1553, "popal inc": 1554, "add bound": 1555, "bound adc": 1556, "bound xor": 1557, "or in": 1558, "ja movsx": 1559, "int3 or": 1560, "jge pop": 1561, "mov cmove": 1562, "jne nop": 1563, "movsx cmp": 1564, "nop outsd": 1565, "outsd add": 1566, "add jg": 1567, "inc xchg": 1568, "xchg cmp": 1569, "cmp xchg": 1570, "xchg js": 1571, "js inc": 1572, "add xchg": 1573, "xchg sub": 1574, "sub xchg": 1575, "xchg mov": 1576, "xchg xchg": 1577, "movzx pop": 1578, "movsd sub": 1579, "jmp sbb": 1580, "ret pop": 1581, "test sets": 1582, "sets jmp": 1583, "cmp setl": 1584, "setl test": 1585, "push cmovne": 1586, "sets test": 1587, "setl mov": 1588, "nop xchg": 1589, "add scasd": 1590, "scasd inc": 1591, "ret xorps": 1592, "nop stosb": 1593, "add in": 1594, "in mov": 1595, "push movsx": 1596, "call movsx": 1597, "sar xor": 1598, "ret sbb": 1599, "jne movsx": 1600, "ret movsd": 1601, "movsd ucomisd": 1602, "ucomisd lahf": 1603, "lahf test": 1604, "jnp xor": 1605, "int3 add": 1606, "sets pop": 1607, "setl pop": 1608, "pop sets": 1609, "pop setl": 1610, "xor comisd": 1611, "comisd pop": 1612, "pop seta": 1613, "seta pop": 1614, "ret in": 1615, "in inc": 1616, "rol rol": 1617, "rol int3": 1618, "sub imul": 1619, "pop cmovb": 1620, "cmovb pop": 1621, "imul sar": 1622, "int3 movsx": 1623, "test jp": 1624, "jp xor": 1625, "nop int3": 1626, "int3 aam": 1627, "aam add": 1628, "add aam": 1629, "movsx sub": 1630, "jmp fild": 1631, "fild fstp": 1632, "fstp fld": 1633, "fld mov": 1634, "movd cvtdq2pd": 1635, "cvtdq2pd shr": 1636, "shr addsd": 1637, "addsd movsd": 1638, "movsd fld": 1639, "ret fld": 1640, "je movsd": 1641, "ret fldz": 1642, "fldz mov": 1643, "add aad": 1644, "aad add": 1645, "movsd comisd": 1646, "comisd jb": 1647, "jb movsd": 1648, "jb cvttsd2si": 1649, "cvttsd2si mov": 1650, "nop salc": 1651, "salc inc": 1652, "add salc": 1653, "sub movsx": 1654, "cmovne push": 1655, "cmove push": 1656, "nop out": 1657, "out salc": 1658, "add xlatb": 1659, "xlatb inc": 1660, "jns jmp": 1661, "add fadd": 1662, "fadd insb": 1663, "insb fadd": 1664, "fadd int3": 1665, "cmp cmove": 1666, "cmove je": 1667, "jne movsd": 1668, "comisd jae": 1669, "inc out": 1670, "out add": 1671, "movsx inc": 1672, "je movsx": 1673, "ret jae": 1674, "cmovne cmp": 1675, "nop popfd": 1676, "popfd sti": 1677, "sti inc": 1678, "add sti": 1679, "xor sar": 1680, "sar and": 1681, "movsx ret": 1682, "jg test": 1683, "ja xorps": 1684, "xorps movlpd": 1685, "movlpd mov": 1686, "cmove add": 1687, "jmp xorps": 1688, "cmove test": 1689, "setge call": 1690, "jle jmp": 1691, "mov setge": 1692, "setge pop": 1693, "setge add": 1694, "jle test": 1695, "cmovne pop": 1696, "test jb": 1697, "cdq cmp": 1698, "movzx ret": 1699, "and xchg": 1700, "xchg and": 1701, "and outsd": 1702, "outsd and": 1703, "push int3": 1704, "push sets": 1705, "sets push": 1706, "lea fstp": 1707, "nop jp": 1708, "jp inc": 1709, "add aaa": 1710, "aaa inc": 1711, "cmp int3": 1712, "test cmovs": 1713, "cmovs test": 1714, "jns cmp": 1715, "cmovae lea": 1716, "cmovae cmp": 1717, "pop cmove": 1718, "xadd jne": 1719, "call lock": 1720, "xadd dec": 1721, "lea cmovg": 1722, "cmovg lea": 1723, "js push": 1724, "movsd and": 1725, "je lock": 1726, "imul call": 1727, "js lea": 1728, "imul sub": 1729, "mov cmovge": 1730, "cmovge cmp": 1731, "jne xorps": 1732, "xorps lea": 1733, "lea movlpd": 1734, "cmovae add": 1735, "imul inc": 1736, "sar sar": 1737, "cmovb test": 1738, "cdq pop": 1739, "pop idiv": 1740, "idiv cmp": 1741, "imul or": 1742, "cmova test": 1743, "addsd mov": 1744, "shr cvtpd2ps": 1745, "cvtpd2ps movd": 1746, "cvtdq2pd addsd": 1747, "addsd cvtpd2ps": 1748, "cvtpd2ps divss": 1749, "divss comiss": 1750, "comiss jbe": 1751, "cmovle push": 1752, "mul test": 1753, "ret lock": 1754, "sub lock": 1755, "cmp cmovl": 1756, "cmovl lea": 1757, "cmp cmovg": 1758, "cmovg cmp": 1759, "cdq sub": 1760, "sar add": 1761, "cmp cmovge": 1762, "cmovge push": 1763, "or jge": 1764, "cmovs pop": 1765, "pop mul": 1766, "movsd or": 1767, "ror push": 1768, "add sbb": 1769, "bnd jb": 1770, "pop xchg": 1771, "movzx nop": 1772, "sub nop": 1773, "movups movq": 1774, "xor movaps": 1775, "movaps movq": 1776, "call movups": 1777, "movups xor": 1778, "cmovae test": 1779, "movups cmp": 1780, "movd movups": 1781, "movups cmovae": 1782, "cmovae movq": 1783, "movq push": 1784, "and lahf": 1785, "lahf and": 1786, "and cmpsd": 1787, "cmpsd and": 1788, "and scasd": 1789, "scasd and": 1790, "cmove dec": 1791, "and popfd": 1792, "popfd and": 1793, "lea sar": 1794, "cdq inc": 1795, "nop movzx": 1796, "ret movups": 1797, "movups lea": 1798, "push movups": 1799, "movups push": 1800, "sete cmovne": 1801, "je js": 1802, "js jne": 1803, "cmovb push": 1804, "cmovne je": 1805, "je movups": 1806, "movups test": 1807, "jne movups": 1808, "movups jmp": 1809, "add cdq": 1810, "mov cmovl": 1811, "cmovl push": 1812, "push seto": 1813, "seto neg": 1814, "neg or": 1815, "add setb": 1816, "setb neg": 1817, "and xorps": 1818, "and movq": 1819, "movq or": 1820, "movups pop": 1821, "movsx shr": 1822, "shr movsx": 1823, "push cwde": 1824, "cwde push": 1825, "cmovs mov": 1826, "push movaps": 1827, "movaps call": 1828, "js test": 1829, "movzx neg": 1830, "movsx shl": 1831, "cdq xor": 1832, "lea cmove": 1833, "jns test": 1834, "mov insd": 1835, "insd inc": 1836, "add insd": 1837, "add outsb": 1838, "outsb inc": 1839, "sub jae": 1840, "cmove cmp": 1841, "mov cmovns": 1842, "cmovns push": 1843, "test setns": 1844, "setns mov": 1845, "cmovne add": 1846, "js call": 1847, "movzx movsx": 1848, "movsx movzx": 1849, "movzx cwde": 1850, "cwde add": 1851, "jae movups": 1852, "pop movups": 1853, "mov jns": 1854, "cmove pop": 1855, "cmovs xor": 1856, "neg cmp": 1857, "js pop": 1858, "lock dec": 1859, "movq call": 1860, "int3 lock": 1861, "cmove ret": 1862, "jmp jns": 1863, "add movups": 1864, "call cld": 1865, "cld retf": 1866, "retf inc": 1867, "add into": 1868, "into inc": 1869, "add iretd": 1870, "iretd inc": 1871, "cmovne cmovne": 1872, "cmovne xor": 1873, "jae movsx": 1874, "nop jno": 1875, "jno inc": 1876, "in add": 1877, "call movq": 1878, "jae nop": 1879, "cmovne nop": 1880, "nop fadd": 1881, "fadd inc": 1882, "nop leave": 1883, "leave or": 1884, "or hlt": 1885, "hlt or": 1886, "or xchg": 1887, "xchg or": 1888, "js jmp": 1889, "jmp movd": 1890, "cvtdq2pd mov": 1891, "nop in": 1892, "in or": 1893, "or aam": 1894, "aam inc": 1895, "jnp mov": 1896, "nop ja": 1897, "movq add": 1898, "lea movaps": 1899, "movaps mov": 1900, "jbe nop": 1901, "nop movsx": 1902, "pop das": 1903, "das inc": 1904, "add das": 1905, "call movaps": 1906, "movaps lea": 1907, "nop cli": 1908, "cli xor": 1909, "cmovne jmp": 1910, "xor movsx": 1911, "xorps pop": 1912, "movq pop": 1913, "mov movlpd": 1914, "xor cdq": 1915, "movsd movaps": 1916, "movaps andps": 1917, "andps comisd": 1918, "comisd jbe": 1919, "cdq fstp": 1920, "fstp xor": 1921, "movsd cmovae": 1922, "cmovae sub": 1923, "pop movq": 1924, "jle dec": 1925, "jle movsx": 1926, "lea cmovle": 1927, "shl not": 1928, "cmove lea": 1929, "setne lea": 1930, "lea cmovne": 1931, "cmovne lea": 1932, "cmovne movzx": 1933, "sar test": 1934, "cmovae call": 1935, "mov cmova": 1936, "cmova sub": 1937, "je sbb": 1938, "xorps xor": 1939, "cmova mov": 1940, "mov setb": 1941, "setb mov": 1942, "add movq": 1943, "jle nop": 1944, "cdq and": 1945, "cmovge mov": 1946, "idiv push": 1947, "jmp imul": 1948, "imul lea": 1949, "mov cmovle": 1950, "cmovle cmp": 1951, "push cmovle": 1952, "lea cmovl": 1953, "cmovl cmp": 1954, "movzx je": 1955, "jl imul": 1956, "add nop": 1957, "cmove or": 1958, "test movzx": 1959, "movzx cmovne": 1960, "test cmovg": 1961, "cmovg mov": 1962, "jg movsx": 1963, "ja movups": 1964, "cmove movsx": 1965, "cmp setg": 1966, "setg cmp": 1967, "cmovle sub": 1968, "push cmove": 1969, "add jno": 1970, "or syscall": 1971, "syscall inc": 1972, "nop jl": 1973, "adc adc": 1974, "or imul": 1975, "or int": 1976, "int inc": 1977, "or cld": 1978, "cld or": 1979, "or adc": 1980, "or das": 1981, "das or": 1982, "cmp or": 1983, "or pushal": 1984, "pushal or": 1985, "or pushfd": 1986, "pushfd or": 1987, "or scasd": 1988, "scasd or": 1989, "add cmovb": 1990, "cmovb add": 1991, "js je": 1992, "cmovae xor": 1993, "nop movss": 1994, "movss movss": 1995, "movss cvtps2pd": 1996, "cvtps2pd cvtps2pd": 1997, "cvtps2pd addsd": 1998, "addsd addsd": 1999, "addsd movss": 2000, "addsd cvttsd2si": 2001, "cvttsd2si cmp": 2002, "cmovge add": 2003, "cmove neg": 2004, "movzx movaps": 2005, "movaps cmp": 2006, "cmovne test": 2007, "inc imul": 2008, "imul test": 2009, "movzx cmove": 2010, "jmp neg": 2011, "jle shr": 2012, "stosd adc": 2013, "adc rep": 2014, "cmovne shr": 2015, "cmovne and": 2016, "jge movzx": 2017, "cmovl mov": 2018, "jns add": 2019, "cmovbe mov": 2020, "imul imul": 2021, "jge nop": 2022, "idiv lea": 2023, "cmp cmovle": 2024, "cmovle xor": 2025, "sar imul": 2026, "neg call": 2027, "ja shr": 2028, "not movzx": 2029, "movsx test": 2030, "jns sub": 2031, "and cdq": 2032, "nop jo": 2033, "jo inc": 2034, "dec cdq": 2035, "shl nop": 2036, "cmp cdq": 2037, "cdq cmovl": 2038, "cmovl idiv": 2039, "neg xor": 2040, "jge jmp": 2041, "cdq neg": 2042, "neg sub": 2043, "shr cwde": 2044, "cwde mov": 2045, "ret bound": 2046, "bound add": 2047, "cld pushal": 2048, "pushal inc": 2049, "add pushal": 2050, "bound mov": 2051, "mov bound": 2052, "bound pop": 2053, "pop bound": 2054, "bound push": 2055, "arpl nop": 2056, "nop arpl": 2057, "js or": 2058, "and fldenv": 2059, "fldenv inc": 2060, "jl jle": 2061, "jge sub": 2062, "out sub": 2063, "sub in": 2064, "xor arpl": 2065, "shl pop": 2066, "sub not": 2067, "mov mulsd": 2068, "mulsd movd": 2069, "fld pop": 2070, "and jns": 2071, "cmovne call": 2072, "ret fadd": 2073, "shr movzx": 2074, "push cmova": 2075, "cmova push": 2076, "jg pop": 2077, "jmp shl": 2078, "nop jnp": 2079, "jnp inc": 2080, "ret imul": 2081, "xorps movq": 2082, "jge add": 2083, "add movsx": 2084, "nop sub": 2085, "jl or": 2086, "mov cmovg": 2087, "dec nop": 2088, "movsb jmp": 2089, "push movsw": 2090, "movsw jmp": 2091, "ret cmpsd": 2092, "cmpsd js": 2093, "js add": 2094, "add jns": 2095, "add jp": 2096, "jp add": 2097, "jne not": 2098, "not test": 2099, "or not": 2100, "xchg sbb": 2101, "nop jle": 2102, "xchg jge": 2103, "xchg push": 2104, "cmovl add": 2105, "mov cmovbe": 2106, "movups sub": 2107, "jle sub": 2108, "jle add": 2109, "push bts": 2110, "bts push": 2111, "call cdq": 2112, "mov idiv": 2113, "test setg": 2114, "setg add": 2115, "shl movzx": 2116, "cmovns pop": 2117, "jle pop": 2118, "call sar": 2119, "movups add": 2120, "ret jne": 2121, "nop call": 2122, "jb nop": 2123, "not or": 2124, "nop fnstsw": 2125, "fnstsw add": 2126, "push setns": 2127, "jge call": 2128, "setne movzx": 2129, "jg movzx": 2130, "push cmovl": 2131, "jl dec": 2132, "idiv test": 2133, "cmova cmp": 2134, "nop or": 2135, "add loopne": 2136, "loopne add": 2137, "cmove cmovne": 2138, "movsx pop": 2139, "shl shr": 2140, "movzx movups": 2141, "sub jns": 2142, "jns movups": 2143, "and sar": 2144, "cmovle add": 2145, "js nop": 2146, "add div": 2147, "cmovne sub": 2148, "movsx cdq": 2149, "cdq shl": 2150, "movsx idiv": 2151, "cdq movsx": 2152, "cmovg inc": 2153, "add xorps": 2154, "movlpd lea": 2155, "jl movd": 2156, "mov movaps": 2157, "movaps test": 2158, "sub movd": 2159, "movups psrld": 2160, "psrld pslld": 2161, "pslld por": 2162, "por movups": 2163, "movups pslld": 2164, "pslld psrld": 2165, "psrld por": 2166, "cmovg push": 2167, "inc movaps": 2168, "cmove inc": 2169, "movlpd cmp": 2170, "jns inc": 2171, "cmovg test": 2172, "shld shl": 2173, "shld inc": 2174, "movzx xorps": 2175, "push shld": 2176, "shld push": 2177, "inc cdq": 2178, "ret not": 2179, "not jmp": 2180, "sar inc": 2181, "xorps sub": 2182, "sub movlpd": 2183, "movlpd js": 2184, "inc movd": 2185, "movd psllq": 2186, "psllq movq": 2187, "lea cmovbe": 2188, "movlpd test": 2189, "sub mul": 2190, "jbe xorps": 2191, "lea mul": 2192, "mul sub": 2193, "xor not": 2194, "not add": 2195, "jl nop": 2196, "movd test": 2197, "mov cmovs": 2198, "lea cmovns": 2199, "rol jmp": 2200, "dec ror": 2201, "ror shr": 2202, "ror ror": 2203, "inc sar": 2204, "sar call": 2205, "cmovl test": 2206, "shl sar": 2207, "not shr": 2208, "not shl": 2209, "not lea": 2210, "add not": 2211, "movups movzx": 2212, "js movzx": 2213, "movups sbb": 2214, "shr imul": 2215, "movups pxor": 2216, "pxor movups": 2217, "jl call": 2218, "dec ret": 2219, "jge movups": 2220, "mov pxor": 2221, "jle call": 2222, "movups nop": 2223, "rol ror": 2224, "ror not": 2225, "not xor": 2226, "ror rol": 2227, "sbb shr": 2228, "shr neg": 2229, "neg shl": 2230, "sbb shl": 2231, "shl neg": 2232, "pop shr": 2233, "xor movq": 2234, "movq xor": 2235, "rol not": 2236, "ror lea": 2237, "rol or": 2238, "inc ror": 2239, "setg pop": 2240, "ret idiv": 2241, "idiv inc": 2242, "add aas": 2243, "aas inc": 2244, "cmovl call": 2245, "jmp jne": 2246, "nop int": 2247, "bound dec": 2248, "dec bound": 2249, "bound int3": 2250, "je cwde": 2251, "or nop": 2252, "stosw lea": 2253, "movzx ja": 2254, "sub cwde": 2255, "jle or": 2256, "cmovge inc": 2257, "sar or": 2258, "jmp je": 2259, "jg inc": 2260, "cmovbe cmp": 2261, "sete or": 2262, "push xorps": 2263, "je xorps": 2264, "push pushfd": 2265, "pushfd inc": 2266, "jg jne": 2267, "sbb stosd": 2268, "stosd inc": 2269, "add stosd": 2270, "add lodsd": 2271, "lodsd inc": 2272, "cmp xorps": 2273, "movq movups": 2274, "jmp movups": 2275, "setg mov": 2276, "jg jns": 2277, "push lds": 2278, "lds pop": 2279, "pop les": 2280, "les add": 2281, "add lds": 2282, "lds mov": 2283, "mov lds": 2284, "lds cmpsb": 2285, "cmpsb les": 2286, "add les": 2287, "les popfd": 2288, "popfd lds": 2289, "lds add": 2290, "les insd": 2291, "insd les": 2292, "lds ret": 2293, "ret lds": 2294, "les jmp": 2295, "jmp lds": 2296, "lds shufps": 2297, "shufps mov": 2298, "les sbb": 2299, "movups adc": 2300, "sbb sbb": 2301, "cmova imul": 2302, "cmp setle": 2303, "setle dec": 2304, "sar movq": 2305, "mov shrd": 2306, "shrd push": 2307, "shrd sar": 2308, "jne sar": 2309, "jmp sar": 2310, "movzx jne": 2311, "mul ret": 2312, "shr rcr": 2313, "rcr shr": 2314, "rcr or": 2315, "jne div": 2316, "add jb": 2317, "mul xchg": 2318, "xchg mul": 2319, "neg neg": 2320, "ror pop": 2321, "je ret": 2322, "or movd": 2323, "movd pshuflw": 2324, "pshuflw movlhps": 2325, "movlhps mov": 2326, "movdqu pxor": 2327, "pxor pcmpeqb": 2328, "pcmpeqb pcmpeqb": 2329, "pcmpeqb por": 2330, "por pmovmskb": 2331, "pmovmskb and": 2332, "jmp bsf": 2333, "bsf add": 2334, "add movd": 2335, "movd xor": 2336, "xor je": 2337, "bt jb": 2338, "jmp bt": 2339, "jae rep": 2340, "jne bt": 2341, "jb bt": 2342, "jae test": 2343, "jae movq": 2344, "jae movdqa": 2345, "movdqa sub": 2346, "sub movdqa": 2347, "cmp movdqa": 2348, "movdqa palignr": 2349, "palignr movdqa": 2350, "jmp movdqa": 2351, "jl movdqu": 2352, "movdqu sub": 2353, "nop movsb": 2354, "movsb xor": 2355, "sub std": 2356, "movdqu lea": 2357, "pcmpeqb pmovmskb": 2358, "jne pmovmskb": 2359, "and bsr": 2360, "bsr add": 2361, "cmovne or": 2362, "push pmovmskb": 2363, "pop bsr": 2364, "add pcmpistri": 2365, "pcmpistri lea": 2366, "lea cmovb": 2367, "cmovb jne": 2368, "pcmpeqb mov": 2369, "shl pmovmskb": 2370, "pcmpeqb add": 2371, "add pmovmskb": 2372, "pmovmskb test": 2373, "je bsf": 2374, "or repne": 2375, "repne scasb": 2376, "scasb add": 2377, "mov std": 2378, "std repne": 2379, "mov cld": 2380, "cld pop": 2381, "cmp cmp": 2382, "nop adc": 2383, "jl bt": 2384, "ret bt": 2385, "jae movd": 2386, "movd pshufd": 2387, "nop movdqa": 2388, "pshufd cmp": 2389, "jb movdqu": 2390, "movdqu mov": 2391, "jg jmp": 2392, "cmpxchg pop": 2393, "int pop": 2394, "xchg jmp": 2395, "xchg test": 2396, "xchg xor": 2397, "jmp xchg": 2398, "jae neg": 2399, "ja imul": 2400, "not push": 2401, "sete neg": 2402, "sete and": 2403, "cmp movsx": 2404, "mov setl": 2405, "movsx setl": 2406, "movsx shld": 2407, "shld sub": 2408, "movsx xor": 2409, "jg shl": 2410, "shl movsx": 2411, "pop jg": 2412, "movsx or": 2413, "lea in": 2414, "jne imul": 2415, "setle ret": 2416, "ret movsx": 2417, "jns or": 2418, "ror ret": 2419, "ror test": 2420, "js imul": 2421, "imul pop": 2422, "push cld": 2423, "cld mov": 2424, "movsx jmp": 2425, "jbe imul": 2426, "jg imul": 2427, "sub jbe": 2428, "int3 sbb": 2429, "and lock": 2430, "pop lock": 2431, "lock or": 2432, "lock and": 2433, "div jmp": 2434, "xor stosd": 2435, "shr ret": 2436, "movsx lfence": 2437, "lfence movzx": 2438, "movzx lfence": 2439, "sete je": 2440, "movzx sete": 2441, "ret aad": 2442, "aad inc": 2443, "call int1": 2444, "int1 lea": 2445, "cmovge xor": 2446, "cmovge sub": 2447, "cmovle test": 2448, "not rol": 2449, "rol and": 2450, "not ror": 2451, "ror and": 2452, "xadd push": 2453, "pop movsd": 2454, "idiv imul": 2455, "call xorps": 2456, "xor movlpd": 2457, "push movsd": 2458, "pop cmovs": 2459, "mul seto": 2460, "pop cmovne": 2461, "lea sete": 2462, "stosd call": 2463, "call fstp": 2464, "fstp movsd": 2465, "jbe movsd": 2466, "push fstp": 2467, "fstp call": 2468, "call movsd": 2469, "cmove movzx": 2470, "pop movsx": 2471, "imul movzx": 2472, "jge imul": 2473, "xadd jns": 2474, "sar movzx": 2475, "movzx bts": 2476, "bts xor": 2477, "lea jl": 2478, "cmpxchg push": 2479, "cmpxchg cmp": 2480, "je jns": 2481, "lea jae": 2482, "nop rol": 2483, "or insb": 2484, "insb or": 2485, "movd jmp": 2486, "movups pcmpistri": 2487, "pcmpistri jne": 2488, "movzx movd": 2489, "movd pcmpistri": 2490, "pcmpistri jae": 2491, "push pxor": 2492, "pxor movzx": 2493, "movzx psrldq": 2494, "psrldq pinsrw": 2495, "pinsrw xor": 2496, "ja pcmpistri": 2497, "pcmpistri jbe": 2498, "jmp jae": 2499, "jae pcmpistri": 2500, "pcmpistri jno": 2501, "jno js": 2502, "movzx pxor": 2503, "pxor mov": 2504, "pop movd": 2505, "pshuflw pshufd": 2506, "pshufd mov": 2507, "movups movaps": 2508, "movaps pcmpeqw": 2509, "pcmpeqw pcmpeqw": 2510, "pcmpeqw por": 2511, "bsf shr": 2512, "bsf and": 2513, "setg lea": 2514, "nop lodsb": 2515, "lodsb sbb": 2516, "sbb stc": 2517, "stc sbb": 2518, "sbb les": 2519, "les inc": 2520, "sbb ficomp": 2521, "ficomp inc": 2522, "setg ret": 2523, "jae imul": 2524, "sub vxorps": 2525, "vxorps add": 2526, "jmp vpcmpeqb": 2527, "vpcmpeqb vpmovmskb": 2528, "vpmovmskb test": 2529, "sub vzeroupper": 2530, "vzeroupper jmp": 2531, "sub pxor": 2532, "jmp movaps": 2533, "movaps pcmpeqb": 2534, "vxorps lea": 2535, "jmp vpcmpeqw": 2536, "vpcmpeqw vpmovmskb": 2537, "sar vzeroupper": 2538, "lea pxor": 2539, "pcmpeqw pmovmskb": 2540, "div dec": 2541, "add cbw": 2542, "cbw mov": 2543, "or neg": 2544, "mov stosb": 2545, "stosb pushal": 2546, "jns movzx": 2547, "push fldz": 2548, "fldz push": 2549, "jne fld": 2550, "fld push": 2551, "je fld": 2552, "fld sub": 2553, "push fadd": 2554, "fadd sub": 2555, "sub fstp": 2556, "fstp fstp": 2557, "call fld": 2558, "fld fchs": 2559, "fchs jmp": 2560, "fld jmp": 2561, "call fldz": 2562, "fldz jmp": 2563, "fld fld": 2564, "sub fadd": 2565, "fadd fstp": 2566, "jmp fldz": 2567, "fldz fucomp": 2568, "fucomp fnstsw": 2569, "fnstsw test": 2570, "and fld": 2571, "fld fstp": 2572, "jmp fld": 2573, "fld add": 2574, "idiv pop": 2575, "idiv neg": 2576, "jmp jg": 2577, "and cbw": 2578, "cbw movzx": 2579, "and movsx": 2580, "idiv cdq": 2581, "idiv jmp": 2582, "jl cdq": 2583, "call jns": 2584, "add jge": 2585, "add jle": 2586, "or div": 2587, "add bts": 2588, "bts jmp": 2589, "add bt": 2590, "pop movsw": 2591, "movsw lea": 2592, "movsb lea": 2593, "movsd movsw": 2594, "mov bsr": 2595, "bsr mov": 2596, "sub stmxcsr": 2597, "stmxcsr mov": 2598, "jne fnstcw": 2599, "fnstcw mov": 2600, "sub fxch": 2601, "fxch fstp": 2602, "fstp fst": 2603, "fst mov": 2604, "push wait": 2605, "wait fnstcw": 2606, "fnstcw cmp": 2607, "call je": 2608, "jne fyl2x": 2609, "fyl2x call": 2610, "jne fchs": 2611, "fchs cmp": 2612, "call fld1": 2613, "fld1 fucomip": 2614, "fucomip jp": 2615, "jp je": 2616, "jmp fxch": 2617, "fxch fxam": 2618, "fxam wait": 2619, "wait fnstsw": 2620, "fnstsw wait": 2621, "wait sahf": 2622, "sahf jne": 2623, "jne fstp": 2624, "fstp fld1": 2625, "fld1 pop": 2626, "ret faddp": 2627, "faddp pop": 2628, "fstp wait": 2629, "wait fnsave": 2630, "fnsave call": 2631, "pop frstor": 2632, "frstor fld": 2633, "fstp mov": 2634, "fld test": 2635, "je fchs": 2636, "fchs mov": 2637, "fldz test": 2638, "jmp fstp": 2639, "fld1 jmp": 2640, "fld call": 2641, "call fchs": 2642, "fchs test": 2643, "fld frndint": 2644, "frndint fcomp": 2645, "fcomp mov": 2646, "mov wait": 2647, "fnstsw sahf": 2648, "jne fmul": 2649, "fmul inc": 2650, "inc fld": 2651, "frndint fcompp": 2652, "fcompp wait": 2653, "ret fstp": 2654, "fstp ret": 2655, "push lock": 2656, "ror neg": 2657, "xchg ret": 2658, "movsx call": 2659, "sbb js": 2660, "sete sub": 2661, "setg sub": 2662, "setg push": 2663, "setl cmp": 2664, "fstp fldz": 2665, "fldz fstp": 2666, "mov fldz": 2667, "fldz fcomp": 2668, "fcomp fnstsw": 2669, "fnstsw fld": 2670, "jnp jmp": 2671, "jnp fld": 2672, "jp fld": 2673, "fchs fstp": 2674, "fstp and": 2675, "mov fld": 2676, "fld fldz": 2677, "fldz fucompp": 2678, "fucompp fnstsw": 2679, "fld lea": 2680, "mov fst": 2681, "fst fldz": 2682, "fldz cmp": 2683, "xor fmulp": 2684, "fmulp inc": 2685, "jmp fcompp": 2686, "fcompp xor": 2687, "xor fnstsw": 2688, "mov fstp": 2689, "fstp jmp": 2690, "fstp pop": 2691, "pop fld": 2692, "fldz fucom": 2693, "fucom fnstsw": 2694, "fnstsw push": 2695, "jp fstp": 2696, "je fcompp": 2697, "fcompp mov": 2698, "mov fnstsw": 2699, "movzx fld": 2700, "fld and": 2701, "and fstp": 2702, "fstp lea": 2703, "and ldmxcsr": 2704, "ldmxcsr jmp": 2705, "ldmxcsr mov": 2706, "mov ldmxcsr": 2707, "ldmxcsr call": 2708, "push fnstsw": 2709, "fnstsw fnclex": 2710, "fnclex movsx": 2711, "mov fldcw": 2712, "fldcw movsx": 2713, "fld fistp": 2714, "fistp wait": 2715, "wait test": 2716, "je wait": 2717, "wait wait": 2718, "je fldz": 2719, "fldz fld1": 2720, "fld1 fdivrp": 2721, "fdivrp fstp": 2722, "je fldpi": 2723, "fldpi fstp": 2724, "wait mov": 2725, "fnstsw movsx": 2726, "xor xchg": 2727, "setge jmp": 2728, "setl jmp": 2729, "jp neg": 2730, "and fxch": 2731, "ret movlpd": 2732, "movlpd movlpd": 2733, "movlpd andpd": 2734, "andpd movsd": 2735, "movsd psrlq": 2736, "psrlq pextrw": 2737, "pextrw orpd": 2738, "orpd pextrw": 2739, "pextrw and": 2740, "and mulsd": 2741, "mulsd movlpd": 2742, "movlpd add": 2743, "add movapd": 2744, "movapd mov": 2745, "movd psubq": 2746, "psubq psrlq": 2747, "psrlq cvtdq2pd": 2748, "cvtdq2pd movlpd": 2749, "movlpd movsd": 2750, "pextrw andpd": 2751, "andpd and": 2752, "mulsd mulsd": 2753, "mulsd add": 2754, "add addpd": 2755, "addpd orpd": 2756, "orpd addsd": 2757, "addsd andpd": 2758, "pextrw movlpd": 2759, "movlpd subsd": 2760, "subsd movlpd": 2761, "movlpd and": 2762, "mulsd addpd": 2763, "addpd andpd": 2764, "andpd subsd": 2765, "subsd addsd": 2766, "movsd mulsd": 2767, "mulsd subsd": 2768, "subsd mulsd": 2769,